[
  {
    "url": "https://jupiter.money/",
    "title": "Jupiter: 1-app For Everything Money",
    "content": "1-app for everything money  Pay faster. Track every spend better. Save  invest for things that matter  all on Jupiter. Download Jupiter Trusted by 30 Lakh Indians All-in-1 savings account Issued By Open account 1 cashback on spends Get rewarded on UPI,Debit Card, and Digital Gold Track spends with Insights Get insights on spends  set monthly budgets Auto-save and invest Save  Invest daily, weekly, or monthly Built for credit. Designed for rewards  The most rewarding credit card 10 Cashback on Shopping 5 Cashback on Travel 1 Cashback on Everything else Apply now Earn 42,000 every year  Lifetime free Edge Edge RuPay Edge Visa Issued By Powered by Get instant loans, for anything Starting at 1. 33 interest Check eligibility Manage your expenses and savings seamlessly Savings simplified Create Pots to auto-save for travel, weddings, and long- term goals Know more Get over overspending Track all your spends and set monthly limits using Budgets Know more Whats New Track all your credit cards Get Insights  reminders for bill payments Trusted by 30 Lakh Indians I love how supportive the customer support team is. Im really enjoying the app! Virender Singh Jupiter really is my one app for all things moneyspends, UPI, savings, and more. Avinash K C This is light years ahead of the banking experience Ive had on other apps. Dhawan M Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 3139
  },
  {
    "url": "https://jupiter.money/savings-account/",
    "title": "Open Savings Account Online: All-in-1 Savings Account on Jupiter by Federal Bank",
    "content": "Trusted by 30 Lakh Indians Savings Account All-in-1 Savings Account  Take control of your money with faster payments, smarter investments, and powerful Insights Issued By Open an account Takes only 2 minutes Rewards on every payment Explore Rewards 1 cashback on UPI Get rewarded on your daily chai, lunch, and cab spends 1 cashback on Debit Card Spend online, offline, locally or globally 1 cashback on Digital Gold Good decisions are always rewarded, after all Spend like a local in 120 countries 0-forex fee  On international spends with your Debit Card 1 cashback On online  offline international spends Standard network charges may apply. Jupiter does not levy additional forex charges. Pay  Track  Save  Invest Make lightning-fast payments Pay any contact, merchant, or app in seconds, with Jupiter UPI Checkmate, spreadsheets Auto-track every spend, get Insights,  set monthly budgets Auto-save for big  small goals Create Pots to set aside money for travel, wedding  more Watch your wealth grow Invest in no-penalty SIPs  Extra 1. 5 returns on selected funds Account Benefits An account for every need Trusted by 30 Lakh Indians Jupiters Debit Card is my go-to for global spends and no forex fees is a huge win! Goutham Krishna N I never need to visit the branch and even though the KYC was online, it felt very secure. Anish Verma This is the first time I could open a savings account in 10 mins without any hassle. Viral P Frequently Asked Questions What is the Jupiter All-in-1 Savings Account? The All-in-1 Savings Account on Jupiter powered by Federal Bank helps you manage your money better with faster payments, smart saving tools, and investment insightsall in one place. How do I open a Jupiter Savings Account? You can open your Jupiter digital account by following a few simple steps Install the Jupiter app Tap Open an all-in-1 Savings Account while selecting a Jupiter experience Complete your video KYC Do I earn Jewels for making payments? Yes! You earn up to 1 cashback as Jewels on UPI payments Debit Card spends online  offline Investments in Digital Gold Can I use my Jupiter Debit Card outside India? Absolutely. You can spend in over 120 countries with 0 forex fee on international transactions using your Jupiter Debit Card. Do I earn Jewels on International payments? Yes, you also earn up to 1 cashback on online and offline international spends. What payment modes are available with the Jupiter account? You can make superfast payments with UPI, IMPS, and debit cardwhether its for recharges, bills, or merchant transactions Can I invest using my Jupiter account? Yes! You can invest in Mutual Funds and Digital Gold with up to 1. 5 extra returns on curated mutual fund plans. What additional benefits do I get with the Savings Account? Yes! You earn up to 1 cashback as Jewels on Free cheque book Free IMPS transfers ATM withdrawals Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 4666
  },
  {
    "url": "https://jupiter.money/pro-salary-account/",
    "title": "Open Salary Account Online With Jupiter Money",
    "content": "Salary Account Loans starting at 0 interest Get Loans, Credit cards, Rewards on every spend,  much more! Open Salary Account  powered by The most rewarding Salary Account Loans that work for you Get a Mini Loan at 0 interest for up to 45 days or a Personal Loan of up to 5,00,000 with 3-12 EMIs Get money in just 2 minutes 100 digital process No documents required More Rewards on your spends Earn 5X Rewards on all Debit Card and select UPI spends. Your Rewards never expire Zero Forex Charges What you see is what you pay! Skip the extra 3. 5 charge on your international Non-ATM transactions Zero-Hidden Fees No hidden charges, fine print or surprises Performance Review of Salary Platform on Jupiter  Compare Jupiter app features with your Salary Account Loans Debit Card rewards UPI rewards Forex Fee Credit Card ATM withdrawals NEFTIMPSRTGS Salary Platform on Jupiter Starting from 0 interest 5x on all spends 5x on select spends Zero Yes 10month Free Get Salary Account Your current Salary account Starting from 12 interest Only on select spends No 3. 50 Yes 4month Free Salary Account on Jupiter Loans Starting from 0 interest Debit card rewards 5x on all spends UPI rewards 5x on select spends Forex Fee Zero Credit Card Yes ATM withdrawals 10month NEFTIMPSRTGS Free Get Salary Account Your current Salary account Loans Starting from 12 interest Debit card rewards Only on select spends UPI rewards No Forex Fee 3. 50 Credit Card Yes ATM withdrawals 4month NEFTIMPSRTGS Free Get the Salary Account for your team or for yourself Jupiter for Teams Recommended for HRs For employers For employees Book a slot with us! Or drop us an email on salaryjupiter. money What to do next. Tell us about yourself  book a slot Learn how you can get Salary accounts for your team Get your team on Jupiter All they need to do is download the app and open an account. It takes less than 3 minutes For salary payout Get their Jupiter account details and transfer their next salaries there. Thats it! Becoming Salary Account user Once their salary is credited to Jupiter, theyll automatically be upgraded to Salary Account user Alright You can also upgrade to a Salary account. Just inform your HR! Step 1 Download the Jupiter app Step 2 Open your account in 3 minutes Step 3 Inform HR to credit salary to your new salary account It keeps getting better  better Pots an easy way to save for your goals Whether you want the latest iPhone, or are planning a holiday, save for all your goals in Pots One UPI. For all your bank accounts Link all your bank accounts in an instant. Scan  Pay easily Insights a breakdown of your money Have your incomes  spends auto-categorised and take control of your finances Insights a breakdown of your money Have your incomes  spends auto- categorised and take control of your finances Spacefire Debit Card Freeze, Unfreeze and set spend limits from the Jupiter app with a tap Lightning-fast Support Prefer a human touch? Connect with a person in seconds, 247. Max Trust Your account is hosted on Federal Bank Max Security Which means bank-grade security and ISO and PCI compliant Max Safety Your money is insured up to 5,00,000 Max Trust Your account is hosted on Federal Bank Max Security Which means bank-grade security and ISO and PCI compliant Max Safety Your money is insured up to 5,00,000 Frequently Asked Questions How is this Salary account different then? Our Salary Account can also be opened by an employee and does not necessarily need an employer to open one for you. Why should I switch to Salary account? Its your Salary Account with extra benefits. Get the most out of your salary. Salary account is an upgraded version of the Basic account. Receive your monthly salary in your new Salary Account to earn maximum rewards on Jupiter, free credit  debit card, Mini Loans starting from 0 interest. How do I open a Salary account? To open a Salary account, follow these easy steps 1. Download the Jupiter app and create your account 2. Complete your video verification  full KYC 3. Submit your companys name and verify your work email address 4. Share your new account details with HR and make sure to get your next salary in your new Salary Account within 60 days. Thats it! Once your salary is credited, youll automatically be upgraded to a Salary account. already have a Savings Account on the Jupiter app. How do I upgrade to a Salary account? To upgrade to a Salary account, please go to Settings on the Jupiter app and follow 3 simple steps. Currently open to select few. Who all can open a Salary account on Jupiter? To open a Salary account, please ensure that your in-hand salary is more 20,000. However, this is negotiable for teams. Please connect with us to learn more about the Salary account. How much time does it take to open a Salary account? It takes only 3 minutes to complete all the steps to open a Salary account. Can I change my already existing salary account? How? Create a new account on the app, submit your new bank account details with your HR to receive further salaries in that account and turn yourself into a Salary Account user Are there any charges for opening a Salary account? Opening a Salary Account on Jupiter is completely free. There are also no charges for UPI, NEFT, and RTGS transactions. What is Mini-Loan? By opening a Salary account, you can instantly withdraw your partial salary before salary day with no interest charges. Im a non-salaried individual. How do I upgrade to Salary account? Keep an eye out  well bring the benefits of Salary account to freelancers  other non-salaried individuals soon. Which documents are required for opening a Salary account? Your Aadhaar card linked with your phone number and PAN card are required to open a Salary account. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us",
    "length": 5829
  },
  {
    "url": "https://jupiter.money/corporate-salary-account/",
    "title": "Jupiter Corporate Salary Account - Zero Fees, Free HRMS, 1% Cashback",
    "content": "The Corporate Salary Account loved by HRs  employees Get a free HRMS, discounted health insurance and 0-interest loans for employees. Book Demo powered by Trusted by HRs and employees from 1,500 companies Upgrade your account with these corporate salary account benefits Lifetime-free HRMS Save up to 1,50,000 on monthly HRMS costs with sumHR  the leading software for payroll, attendance tracking, and more Awarded Best HRMS 3 years in a row Book a Demo Discounted employee health insurance Save up to 2,205 per employee. Get full coverage from day one and free medical consultations. Know more Mini Loans at 0 interest Give your employees access to interest-free loans, credited instantly to their Salary Account. Explore now Easy Payroll Management Get a payroll portal that lets you process bulk salary payments seamlessly. Know more Jupiter for Teams Book a slot with us! Or drop us an email on salaryjupiter. money Ragini Das FOUNDER Leap club Were a fast paced team and we are always looking for products. Right from the seamless onboarding experience including the video KYC to real-time questionsqueries solved by the friendly  warm Jupiter team, we appreciate the speed of execution, clarity and support weve received throughout. Deepak Kothari Co-founder, COO FTCash Early Salary and Health Insurance in addition to the expense management tools made it easy for us and our employees to manage finances. Also Jupiter has an exceptional customer service  always provided us with speedy solutions to any issues we faced. Pawan Demla Co-founder CELLBELL Before Jupiter, we didnt had any single solution to offer various benefits to our employees such as 2Lac health insurance, advances via banking partners , or a consistent cashback on UPI. Now they are happy to build healthy finance habits too along with various inbuilt features like MF and Mini RDs as Jars. Rated 5 stars by employees 1 cashback on spends Earn 1 extra when you spend using your Debit Card  UPI The most rewarding Salary Account Zero hidden charges Zero Forex Fee Instant Mini Loans up to 75,000 Free Debit Card Earn 1,000 per referral Improve the financial wellness of your employees Help your employees track spends, save money, invest regularly, and get rewarded with cashback. Track spends by Category. Take control with Insights! Take control with Insights! Invest in Mutual Funds, Fixed Deposits, and Digital Gold Earn up to 6. 8 Interest with Recurring Deposits in Pots Get Salary Account for your team powered by A Corporate Salary Account thats simply better Discounted Health insurance Discounted Accidental insurance Debit Card rewards UPI rewards Forex Fee Mini Loans at 0 interest Salary Platform on Jupiter Yes, up to 5 Lakhs Yes, 5 Lakhs 1 on all spends 1 on select spends 0 Yes Unlock after 3 salary credits Get Salary Account Other Salary accounts No Yes Only on select spends No 3. 50 No You are in safe hands Max Trust We host your account in Federal Bank Max Security Bank-grade security and ISO and PCI compliant Max Safety Your money is insured up to 5,00,000 Frequently asked questions How much does the Corporate Salary Account cost?  Its completely free. What if my company already has salary accounts for employees with another bank?  If you have an existing account with another bank, you can continue using it for business banking. You can still use Jupiter Corporate Salary Account for your employees with discounted medical insurance, 0 interest loans, 0 forex fees, and more. Ultimately, you get the best of both worlds. Is my employees money safe?  It is 100 safe. Jupiter Corporate Salary Account is hosted in an RBI-licensed bank Federal Bank and the money in the account is insured up to 5,00,000. Does my company need a minimum number of employees?  We support companies of all sizes. From 2-person businesses to organizations that have over 1000 employees. What is the benefit for my company?  Jupiter Corporate Salary Account helps you save up to 50,00,000 yearly by cutting down on HRMS costs, payroll software costs and health insurance costs. You can streamline payout processes with our bulk salary payout portal Your employees can also get loans at 0 interest, and invest in Mutual Funds and Digital Gold on Jupiter Which documents are needed for opening a Salary Account?  Your employees need to have the following to open a Jupiter Corporate Salary Account Physical PAN card A smart phone Mobile number linked to Aadhar card PAN  Aadhaar should be linked What is the initial deposit when you open a Salary Account?  No initial deposit is required to open a Salary Account. Do we need to shift our Current Account to Jupiter?  Absolutely not, your existing relationship with banker is mostly for Business Banking. You shall continue enjoying benefits provided by your existing banker for business banking  enjoy additional benefits from Jupiter against your employees bank account. You get to enjoy the best of both worlds. Do employees need to maintain any minimum balance?  While users are required to maintain 5,000 as the average monthly balance, charges up to 200 for not maintaining of balance. However for Salary Account users, the account is a zero balance account on consistent salary credits. Is it a Federal bank account or Jupiter account?  A Federal Bank account is created for each employee. They can use the Jupiter app to pay, invest or save money without any restrictions. Can the employee continue with the Jupiter salary account even if he leaves the present company?  Your employees can continue using the same Salary Account with their new employer and keep enjoying our benefits. If any employee has an active loan with their current bank, can they still use the Jupiter Corporate Salary Account?  They can continue paying their loan with their existing bank. Jupiters Autopay feature lets them auto-transfer any amount from their Jupiter account to their existing bank, ensuring their loan payments continue seamlessly. Frequently Asked Questions How much does the Corporate Salary Account cost? Its completely free. What if my company already has salary accounts for employees with another bank? If you have an existing account with another bank, you can continue using it for business banking. You can still use Jupiter Corporate Salary Account for your employees with discounted medical insurance, 0 interest loans, 0 forex fees, and more. Ultimately, you get the best of both worlds. Is my employees money safe? It is 100 safe. Jupiter Corporate Salary Account is hosted in an RBI-licensed bank Federal Bank and the money in the account is insured up to 5,00,000. Does my company need a minimum number of employees? We support companies of all sizes. From 5-person businesses to organizations that have over 1000 employees. What is the benefit for my company? Jupiter Corporate Salary Account helps you save up to 50,00,000 yearly by cutting down on HRMS costs, payroll software costs and health insurance costs. You can streamline payout processes with our bulk salary payout portal Your employees can also get loans at 0 interest, and invest in Mutual Funds and Digital Gold on Jupiter Which documents are needed for opening a Salary Account? Your employees need to have the following to open a Jupiter Corporate Salary Account Physical PAN card A smart phone Mobile number linked to Aadhar card PAN  Aadhaar should be linked What is the initial deposit when you open a Salary Account? No initial deposit is required to open a Salary Account. Do we need to shift our Current Account to Jupiter? Absolutely not, your existing relationship with banker is mostly for Business Banking. You shall continue enjoying benefits provided by your existing banker for business banking  enjoy additional benefits from Jupiter against your employees bank account. You get to enjoy the best of both worlds. Do employees need to maintain any minimum balance? While users are required to maintain 5,000 as the average monthly balance, charges up to 200 for not maintaining of balance. However for Salary Account users, the account is a zero balance account on consistent salary credits. Is it a Federal bank account or Jupiter account? A Federal Bank account is created for each employee. They can use the Jupiter app to pay, invest or save money without any restrictions. Can the employee continue with the Jupiter salary account even if he leaves the present company? Your employees can continue using the same Salary Account with their new employer and keep enjoying our benefits. If any employee has an active loan with their current bank, can they still use the Jupiter Corporate Salary Account? They can continue paying their loan with their existing bank. Jupiters Autopay feature lets them auto-transfer any amount from their Jupiter account to their existing bank, ensuring their loan payments continue seamlessly. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us",
    "length": 8942
  },
  {
    "url": "https://jupiter.money/pots/",
    "title": "Jupiter Pots: Smart Auto-Saving for Goals | Save Money Easily",
    "content": "Save in Pots An intelligent piggy bank Auto-save for multiple goals and track progress in one place Bid adieu to pesky fees and move money any time Make a pinky promise. Get rewarded Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 1981
  },
  {
    "url": "https://jupiter.money/payments/",
    "title": "Payments - UPI, Auto Pay, Debit Cards, NEFT, RTGS, and More",
    "content": "Trusted by 30 Lakh Indians Payments Fast. Rewarding  Just the way payments should be! Download Jupiter Pay your way. Everywhere! Pay to mobile, bank,  UPI ID Scan  Pay or pay any contacts mobile via Jupiter UPI Pay bills from 15 categories Save up to 20 on all your bill payments with Jupiter Set up auto-pay Never miss a bill ever again. Auto-pay recurring bills easily Track where your money goes Insights Get real-time breakdowns of where and how much you spend Budgets Set a monthly spending limit  stay in control of your finances Bill reminders Get notified before your bills are due and avoid late fees Turn spends into investments Auto-invest 10 or more in Mutual Funds or Digital Gold every time you pay UPI. But smarter! Explore Rewards 2 cashback on UPI Link your RuPay Credit Card  earn up 2 Cashback on all UPI payments Whats New Credit card tracking See all your credit card spends in 1 place Trusted by 30 Lakh Indians I use Jupiter for my daily UPI payments and dont even carry a wallet anymore! Ziaur Rahman I started using Jupiter 10 months ago and I havent faced a single UPI failure so far! Sai Madhav Ive been using Jupiter for the past two and half years and it has exceeded all my expectations. Manjunath Neelmath Frequently Asked Questions What payment methods does Jupiter support? You can make payments via UPI, your linked bank account, and debit cards. You can also link any banks RuPay Credit Card to Jupiter UPI and make payments. Is it safe to make payments through Jupiter? Yes. Jupiter uses industry-standard encryption and is compliant with RBI regulations to ensure secure and private transactions. Can I pay my bills using Jupiter? Yes, you can pay utility bills like electricity, gas, DTH, water, and mobile recharges directly from the app. Can I link multiple bank accounts to Jupiter? Yes, you can link more than one bank account and switch between them when making UPI payments. Can I track my payments on Jupiter? Yes, you can track all your payments, see your top spending categories, and get actionable insights to better manage your money. How do I earn cashback or rewards on payments? If you have a PRO Savings Account, you earn 1 cashback on all Debit Card payments and UPI payments from 7 top brands. If you have linked any RuPay Credit Card to Jupiter UPI, you earn up to 2 cashback on every payment. Cashback is credited in the form of Jewels. 5 Jewels  1 Are there any charges for UPI transactions? No, UPI payments are free of charge on Jupiter. Is there a transaction limit for UPI payments? Yes, the daily UPI limit is set by your bank and NPCI, which is generally 1 Lakh per day. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 4433
  },
  {
    "url": "https://jupiter.money/bills-recharges/",
    "title": "Pay Bills, Earn Rewards: Manage Bills and Set Autopay on Jupiter",
    "content": "Trusted by 30 Lakh Indians Bills  Recharge Your bills  recharges, now with rewards! From credit card to electricity bills, DTH to broadbandpay for all the services in seconds and get cashback while youre at it. Download Jupiter Effortless bill payments, every time. Monthly bills on autopilot Set up autopay for bills, subscriptions, and more Save on bills with Jewels Jewels earned on Jupiter can be redeemed on bill payments Here are all the services you can pay for Trusted by 30 Lakh Indians With Autopay on Jupiter, my bills are sorted every month, and I earn Jewels that actually reduce next months payments. Yesh Paying bills used to be a chore. Now its quick, seamless, and I get rewarded for it. Sonakshi I pay all my monthly bills on Jupiter. I even use it for FASTag recharge. Arindam Frequently Asked Questions What types of bills can I pay on Jupiter? You can pay your credit card bills, electricity, DTH, broadband, water, gas, mobile prepaid, and moreall in one place. What payment modes can I use to pay bills on Jupiter? You can pay bills through bank transfers linked to your Federal Bank Savings Account, UPI, or your RuPay Credit Cards. Do I get rewards for bill payments? Yes! You earn Jewels for every eligible bill and recharge made with Jupiter. What are Jewels and how do they work? Jewels are credits you earn when you make eligible payments with Jupiter. You can redeem them in cash for instant discounts on future bill payments. 1 5 Points As per the rewards policy How do I activate Autopay? To set up Autopay for bills  recharges, use your Jupiter UPI ID as a default payment method on the respective merchant app or website. Do I need to upload any documents or enter bill details manually each time? No paperwork needed! Just link your billing merchant once, and your dues automatically in the future. Can I track my past payments? Yes, your entire payment history is available under the Bills  Recharges section in the app. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 3755
  },
  {
    "url": "https://jupiter.money/pay-via-upi/",
    "title": "Jupiter - Fast, Secure UPI Payments with Rewards",
    "content": "Trusted by 30 Lakh Indians UPI Payments Super-fast. Super-secure  UPI payments powered to keep up with your fast-paced life. Download Jupiter More ways to pay Link any RuPay Credit Card Earn up to 2 extra cashback on card spends via Jupiter UPI Get Edge CSB Bank RuPay Credit Card Earn assured 2 cashback on all UPI spends. Send money to friends Pay any contact on any UPI app instantly New on Jupiter Pay in 1-tap for small, daily needs with UPI Lite One-tap payments for daily, small UPI spends Secured for your peace of mind. All your payments are 100 encrypted with ISO and PCI compliant bank-grade security Trusted by 30 Lakh Indians I use Jupiter for my daily UPI payments and dont even carry a wallet anymore! Ziaur Rahman I started using Jupiter 10 months ago and I havent faced a single UPI failure so far! Sai Madhav Ive been using Jupiter for the past two and half years and it has exceeded all my expectations. Manjunath Neelmath Frequently Asked Questions What type of payments can I make with Jupiter UPI? You can send money, pay contacts, scan QR codes at stores, and shop onlinesecurely and instantly. Do I need to open a Jupiter Savings Account to use UPI? No, you can use Jupiter UPI with your existing bank account by linking it on the Jupiter app. What rewards do I get with my Edge CSB Bank RuPay Credit Card? You can get 2 cashback on UPI  credit card spends with the Edge CSB Bank RuPay Credit Card. Can I send money to contacts using other UPI apps? Absolutely. Jupiter lets you send money to anyoneregardless of the UPI app they use. What is UPI Lite and how does it work? UPI Lite lets you make small-value payments without entering your UPI PIN Up to 5,000. Its perfect for quick spends like groceries or tea. Is there a limit on UPI transactions? To ensure safety of your transactions, NPCI has set the maximum daily UPI payments limit to 1 Lakh. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 3673
  },
  {
    "url": "https://jupiter.money/magic-spends/",
    "title": "Magic Spends: Auto-Invest While You Spend on Jupiter",
    "content": "Trusted by 30 Lakh Indians Magic Spends Turn spends into investments  Auto-invest in Mutual Funds and Digital Gold every time you spend Download Jupiter Grow your wealth auto-magically Start with just 10 Invest small and grow your savings at your own pace Set an investment limit Choose how much you want to auto-invest every month Invest in Mutual Funds or gold Choose from 1,100 funds or save in 24K Digital Gold Trusted by 30 Lakh Indians I invest in Mutual Funds every time I spend on food, a cab, groceries, and more! Avishek I love that I invest around 1,500 extra every month with Magic Spends. Manish I feel less guilty spending on Jupiter because I auto-invest in Gold every time! Adwait Frequently Asked Questions What is Magic Spends and how does it work? Magic Spends is an exclusive feature on Jupiter to automatically invest every time you spend. You can select any amount, set a monthly limit, and invest in either Mutual Funds or Digital Gold with every UPI, Debit Card, and Credit Card payment. Where can I invest with Magic Spends? You can invest in a Mutual Fund of your choice or 24K Digital Gold every time you spend. Can I customize how much money I auto-invest every time I spend? Yes, you can auto-invest 10 or more in Digital Gold or 100 or more in Mutual Funds every time you spend with Magic Spends. Can I track my invested amount with Magic Spends? Yes, you can track the value of your invested amount in real-time for both Mutual Funds and Digital Gold. What happens if I dont have enough balance in my account? If you dont have enough balance while spending, Magic Spends will be skipped. You can continue auto-investing after you add money to your account. Can I pause Magic Spends or withdraw my invested amount? Yes, you can pause Magic Spends anytime through the app. You can also withdraw the money youve invested and it will be credited instantly to your account. Are there any fees or charges for Magic Spends? No, Magic Spends is completely free to set up and Jupiter does not charge any commissions. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 3837
  },
  {
    "url": "https://jupiter.money/edge-plus-upi-rupay-credit-card/",
    "title": "Apply for RuPay Credit Card - Jupiter Edge+ CSB Rupay Credit Card",
    "content": "Trusted by 30 Lakh Indians Crafted for Powered by Issued By Credit card The most-rewarding credit card Issued By Powered by Check credit limit Get rewarded, wherever you spend 10 cashback on shopping Shop every wishlist from brands you love 5 cashback on travel Rewards on daily commute  vacations 1 cashback on everything else A little extra indulgence for everyday spends Save up to 50,000 every year Cashback made crystal clear Cashback will be credited in the form of Jewels 5  1 Every 5 Jewels  1, ready to redeem whenever you like. Ease of UPI on credit cards Scan  Pay any QR to make UPI payments with your Edge CSB Bank Rupay Credit Card. Limited period offer 999 499 GST joining fee Get benefits worth 1,900 Free Amazon Prime 1 year subscription worth 1,499 Free Fraud Protect 1 year card protection plan worth 399 Lifetime free with no annual fee, ever Credit made simpler and smarter Pay later with EMI Convert your UPI and credit card spends to EMI starting at just 1. 33 interest Save 1 on fuel Get a 1 surcharge waiver on every fuel spend Powerful insights Track all your spends and get reminders so you never miss a bill payment Frequently Asked Questions How can I apply for the Edge CSB Bank RuPay Credit Card? You can check your eligibility and credit limit for the credit card instantly. To apply for the card, download the Jupiter app and complete your application anytime. Its 100 digital with no paperwork! Whats the maximum cashback I can earn with Edge? There is no maximum limit of cashback which can be earned with Edge, there are limits on accelerated cashback for categories. What is the maximum cashback I can earn for each category? The maximum cashback applicable under each category is 10 cashback - 1,500 per billing cycle merchant limit of 500 5 cashback - 1,000 per billing cycle 1 cashback - No Limit How is cashback credited? The cashback amount is credited to your account instantly in the form of Jewels. 5 Jewels  1 and you can redeem Jewels as cash, gift cards, Digital Gold, and for bill payments. Which brands does Edge offer cashback on? 10 cashback on shopping Amazon, Flipkart, Myntra, Ajio, Zara, Nykaa, Croma, Reliance Trends, Tata Cliq, Reliance Digital 5 cashback on travel MakeMyTrip, EaseMyTrip, Yatra, Cleartrip 1 cashback On all other offline  online eligible spends. Please note that we display third-party brand logos only to indicate where cashback is applicable, and it does not amount to any endorsement by either party. All trademarks belong to their respective owners. The brands are subject to change. Are there any fees for the Edge card? There is only a one-time joining fee of 499GST for the card. You also get a Fraud Protection Plan by OneAssist which includes an Amazon Prime Membership worth 1499. The card is lifetime free with no annual fee. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 4611
  },
  {
    "url": "https://jupiter.money/edge-csb-rupay-credit-card/",
    "title": "Jupiter RuPay Credit Card | CSB Bank Edge UPI Credit Card",
    "content": "LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER Network partner Issued by The 3-in-1 RuPay Credit Card Switch between shopping, travel and dining 2 cashback  Lifetime free The credit card you switch Buying anything? Switch to Shopping 2 cashback on fashion, groceries, electronics, and more Planning a vacation? Switch to Travel 2 cashback on flights, trains, hotels, and more Dining out? Switch to Dining 2 cashback on food delivery, restaurants, and more Rewards on every credit card spend Assured 2 cashback On either shopping, travel, or dining Assured 0. 4 cashback On all other UPI and credit card spends Welcome rewards Worth 250 on your UPI  card spends Its lifetime free Ease of UPI. On a credit card Scan  Pay any QR to make UPI payments with your Edge CSB Bank RuPay Credit Card Take control of the out-of-control Get Insights on both UPI and credit card spends 1-click card controls Copy number Freeze card Reset PIN Card limits Frequently asked questions How can I start using UPI on my RuPay Credit Card?  Install the Jupiter app and apply for the Edge CSB Bank RuPay Credit Card. Fill in the necessary details. Once approved, you can start using the card to make UPI payments on your RuPay Credit Card. How to use the Edge CSB Bank RuPay Credit Card for UPI payments?  You can enable online transactions on your Edge RuPay Credit Card to use it on any website or app. Can I send money to friends using a Credit Card on UPI?  No, you can only use the Edge CSB Bank RuPay Credit Card to pay online and offline merchants. Who can apply for a RuPay Credit Card?  Anyone between 23 and 60 years and with a good credit score can apply for the Edge CSB Bank Credit Card. Is it safe to use my RuPay Credit Card on UPI?  It is absolutely safe to use your RuPay Credit Card on UPI. Can I withdraw money from UPI Credit Cards?  Currently, ATM withdrawal is not enabled on your Edge RuPay Credit Card. How can I use my RuPay Card for online payments?  Once you enable online transactions on your Edge RuPay Credit Card, you can use it on any website or app to pay. How can I pay a retail merchant offline with UPI on Credit Card?  Edge RuPay Credit Card allows you to make UPI payments with a Credit Card. You can scan any QR code and pay with your credit card. How can I link my Edge CSB Bank Credit Card to UPI?  Once you have activated your credit card on Jupiter, you will be able to use it with Jupiter UPI automatically. Will I earn rewards on UPI Spends using the Edge CSB Bank RuPay Credit Card?  Yes, you can earn assured 2 cashback on UPI transactions. How do I generate UPI PIN for my Edge CSB Bank RuPay Credit Card?  You can easily set your Edge UPI Credit Card PIN by going to Credit Card tab on home screen  Choose View Card  Tap Settings gear on top  Tap Reset PIN. Then change your PIN What is the eligibility criteria for getting the Edge CSB Bank RuPay Credit Card?  Currently users with a good credit score, and who are older than 21 years can be eligible for the Edge RuPay Credit Card",
    "length": 3356
  },
  {
    "url": "https://jupiter.money/edge-visa-credit-card/",
    "title": "Jupiter Visa Credit Card | Federal Bank Edge Credit Card",
    "content": "LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER  LIMITED ACCESS  MOVE TO JUPITER Issued by Federal bank Assured 2 Cashback On either Travel, Dining, or Shopping spends Download Jupiter Issued by  Powered by Your choice of extra rewards Upgrading your wardrobe? Switch to Shopping 2 cashback on fashion, groceries, electronics, and more Planning a vacation? Switch to Travel 2 cashback on flights, trains, hotels, and more Night out? Switch to Dining 2 cashback on food delivery, restaurants, and more Rewards on every spend Assured 2 cashback On either shopping, travel, or dining Assured 0. 4 cashback On your international transactions No hidden fees Control edge from Jupiter Get insights on your spends. Take control of your money. 1-click card controls Copy number Freeze Card Reset PIN Card Limits Frequently asked questions How can I apply for a Edge Federal Bank Visa Credit Card?  Edge Federal Bank Visa Credit card is available exclusively on the Jupiter app. Download the Jupiter app and apply for a Edge Federal Bank Visa Credit Card. How can I check my Edge Federal Bank Visa Credit Card Outstanding Balance?  On the Jupiter app, go to the Credit Cards tab, here, you will be able to see the current outstanding and available limit. Can I use my Edge Federal Bank Visa Credit Card for international payments?  Yes, you can do international transactions with your Edge Federal Bank Visa Credit Card. How to activate Edge Federal Bank Visa Credit Card?  Activate your card by scanning the QR code on the card kit Who is eligible for Edge Federal Bank Visa Credit Card?  Anyone older than 21 years and with a good credit score can apply for the Credit Card. What are the fees and charges on the Edge Federal Bank Visa Credit Card?  Edge Federal Bank Visa Credit Card has zero joining fee and zero service charges for transactions. Read MITC for more information. Can I withdraw money using the Edge Federal Bank Visa Credit Card?  Currently, ATM withdrawals are not enabled on your Edge Federal Bank Visa Credit Card. Is Edge Federal Bank Visa Credit Card lifetime free?  Edge Federal Bank Visa Credit Cards annual fee of 999 is waived off on eligible spends of 1. 2 lacs in the preceding year What is the credit limit of Edge Federal Bank Visa Credit Card?  Your limit is calculated based on your credit score",
    "length": 2634
  },
  {
    "url": "https://jupiter.money/loan/",
    "title": "Apply for an Instant Personal Loan Online - Jupiter",
    "content": "Trusted by 30 Lakh Indians Loan Get a Personal Loan up to 5 Lakhs  1. Credited in 2 minutes Check eligibility Borrow better with Personal Loans on Jupiter Applying for a loan on Jupiter takes less than 2 minutes. No paperwork, no spam calls. 100 digital Borrow, manage, and repay your loan directly on Jupiter No hidden charges All fees  charges can be checked on Jupiter EMI reminders Get payment reminders before your loan EMI is due 24x7 support Talk to a support agent to resolve any query Instant loans for all your needs Personal Loan Starting at 1. Repay in up to 24 EMIs Get up to 5,00,000 Mini Loan 0 interest. Repay in up to 45 days Get up to 1,00,000 Loan against Mutual Funds 10. Repay in up to 36 EMIs Get up to 50,00,000 EMI calculator for loans on Jupiter See how much EMI youll have to pay when you take a Personal Loan on JUpiter How to apply for a Personal Loan on Jupiter Check eligibility Check eligibility Eligibility Criteria for a Personal Loan Nationality Indian Age limit 23 to 60 years Salaried,Business Owner, Self-Employed Professional Get an instant loan for any expense From last minute travel plans to medical emergencies, get up to 5 Lakhs for any expense. Laptop Medical Mobile Travel Marriage Used Car Debt consolidation Consumer Durable Home Renovation Two- wheeler Emergency Existing Jupiter app users can click the Apply Now button in the Loans section, fill in the requested details in the loan application, and press Check Eligibility to determine their eligibility. If you already have a salary account on Jupiter, you might be eligible for a personal loan based on factors like your credit score and account history within the app. If you dont have a salary account on the Jupiter app, you can increase your chances of unlocking this feature by receiving two consecutive salary credits in your Jupiter salary account. Trusted by 30 Lakh Indians Overall a fantastic app, your money, savings and loans all in one place. Anil Jupiter is a great app for loans and savings account Ghananagaraju Frequently Asked Questions What types of loans can I get on Jupiter? You can choose from the following loan options Personal Loan - Up to 5,00,000 Mini Loan - Up to 1,00,000 Loan against Mutual Funds - Up to 50,00,000 Who can apply for a Personal Loan on Jupiter? To apply for a Personal Loan, you must Be an Indian resident Be 21 to 60 years old Be either salaried, business owner, or self-employed What are the interest rates applicable on loans with Jupiter? Personal Loans start at 1. 33 per month Mini Loans have 0 interest If repaid in 45 days Loans against Mutual Funds start at 10. 5 per annum Is the loan application process fully digital? Yes, the entire process, from checking eligibility to receiving funds, is 100 digital on the Jupiter app. How do I apply for a loan on Jupiter? Check your eligibility Select your preferred loan option Confirm the loan details Get money instantly in your account Will I get reminders for my EMI payments? Yes, Jupiter sends timely EMI reminders so you never miss a due date. Is there any support if I face issues? Yes, you get 24x7 support from our team via the Jupiter app. What can I use my loan for? The loans are flexible and can be used for any purpose, including Laptop or phone purchase Medical expenses Travel, wedding, or home renovation Debt consolidation or emergencies We work with trusted partners We always keep your money and data safe with strong encryption and built-in privacy protections. SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. TCs apply  In partnership with  Amica Finance Private Limited",
    "length": 5117
  },
  {
    "url": "https://jupiter.money/loan-against-mutual-funds/",
    "title": "Apply Loan Against Mutual Funds - No Paperwork Needed!",
    "content": "Trusted by 30 Lakh Indians Loan Against Mutual Funds Get a Loan against your Mutual Funds  Pledge your funds instead of selling them and get up to 50 Lakhs Apply on Jupiter Heres how it works Check eligibility EMI Calculator Your funds remain yours Keep earning interest and redeem your funds after your repay the loan Grow your wealth, even when you borrow Applying for a loan on Jupiter takes less than 2 minutes. No paperwork, no spam calls. Keep earning returns on your funds Since your funds are pledged and not sold, they keep earning interest Apply without a credit score Get up to 50 Lakhs without any credit score Repay in up to 3 years Pay the principal amount anytime in up to 3 years  the interest in EMIs Frequently Asked Questions What is a loan against mutual funds? A Loan Against Mutual Funds lets you borrow money by pledging your Mutual Funds. On Jupiter, you can get a Loan Against Mutual Funds of up to 2 Crore. How much money can I borrow? Your loan limit will depend on the amount and type of Mutual Funds in your portfolio. Can I choose any date for my monthly loan repayment? You can repay the principal amount anytime within 36 months and the interest in 12 EMIs Do I need to pay interest on the whole amount I am eligible for? No, you pay monthly interest only on the withdrawn amount out of the total credit limit given to you. What is lien markingpledging of Mutual Funds? When you take a Loan Against Mutual Funds, your funds will be lien marked. This means, the lender has the right to hold your units and sell them in case the loan isnt repaid. However, your funds will continue earning returns and will be redeemable once the loan is fully repaid. Which mutual fund schemes are accepted or can be pledged to take loans? Your loan limit can be up to 75 of the Net Asset Value NAV of your Debt Mutual Funds, and 45 of the NAV of Equity Mutual Funds. For example, if you have invested 3 Lakh in Debt Mutual Funds and 1 Lakh in Equity Mutual Funds, your available loan limit will be75 of 3 Lakhs  45 of 1 Lakh  2. 70 Lakh How do I check my limit? You can check your limit on the Jupiter app Can I pledge any Mutual Fund? Yes, you can pledge any eligible Mutual Fund. You can also choose the number of units you want to pledge. When can I redeem the Mutual Funds I have pledged? Your Mutual Funds will be redeemable once your loan is fully repaid What is the tenure of the loan against mutual funds? You can repay the principal amount in up to 36 months and the interest in 12 EMIs What is the credit limit and how is it calculated? Your credit limit is calculated based on the value of your Mutual Funds portfolio Link to doc LAMF Landing Page  SEO Requirements Trusted by 30 Lakh Indians I got the money I needed in no time with loans against mutual funds Pranesh The flexible EMIs made it way easier to manage the loan than I expected. Anshul Yadav I love that the interest rate is low and I dont have to lose my investment returns. Joshua Santosh We work with trusted partners We always keep your money and data safe with strong encryption and built-in privacy protections. SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. TCs apply  In partnership with  Amica Finance Private Limited",
    "length": 4736
  },
  {
    "url": "https://jupiter.money/rewards/",
    "title": "Jupiter Money Rewards: Earn & Redeem Jewels for Cash, Gold & More!",
    "content": "Rewards Spending just got more rewarding  Earn Jewels every time you spend and redeem them as cash, gold, vouchers, or for bill payments Download Jupiter Trusted by 30 Lakh Indians Earn. The Jewels you earn can be redeemed instantly on the Jupiter app. Rewarding in more ways than one PRO Savings Account Get 1 cashback on UPI, Debit Card, and Digital Gold Edge CSB Bank RuPay Credit Card Assured 2 cashback on shopping, dining or travel Link any RuPay Credit Card Earn up to 2 cashback on every UPI spend Real rewards. Whats New Mutual Funds Baskets Invest in a balanced mix of different funds Trusted by 30 Lakh Indians Rewards are better than most cardseverything works like butter. Gaurav Garg I love the rewards on the Debit Card and the card design is sleek and simple. Prabin The best service and especially the cashback offer system is just awesome. Adarsha Roy Frequently Asked Questions How do I earn Jewels on Jupiter? You earn Jewels when you spend using Jupiterwhether its with UPI, your debit card, or linked credit cards. 5 Jewels  1 Rupee What can I redeem Jewels for? You can choose from the following loan options Digital Gold Cash credits Gift vouchers Bill payments Credit card discounts How fast can I redeem Jewels on Jupiter? Yes, you can redeem the Jewels instantly. You can convert them to cash, gold, vouchers or use them to get discounts on bill payments. Do I get extra rewards with linked accounts or cards? Yes! For example PRO Savings Account users get 1 cashback Edge CSB Bank RuPay Card users get 2 cashback Linking any RuPay credit card earns you up to 2 cashback on UPI and spends Do the earned Jewels expire? Your Jewels are safe and redeemable directly on the Jupiter app. Expiry terms, if any, are clearly shown under your rewards dashboard. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 3578
  },
  {
    "url": "https://jupiter.money/investments/",
    "title": "Jupiter Money: Invest in Mutual Funds, Digital Gold & Fixed Deposits",
    "content": "Trusted by 30 Lakh Indians Investments Wealth building on autopilot  Invest in Mutual Funds, Digital Gold, and Fixed Deposits. Manage your entire portfolio in 1 place Download Jupiter All-new ways to invest Mutual Funds Baskets Diversify your portfolio by investing in a balanced mix of different funds No-Penalty SIPs Missing an SIP is less stressful now. Pay 0 penalty when you skip a SIP Magic Spends Make investing a habit. Auto-invest 10 or more every time you spend FlexiFD Never break your Fixed Deposit again. Withdraw money anytime, without breaking your FD Investing on Jupiter Mutual Funds 1,100 funds at your fingertips No commissions or extra fees No-Penalty SIPs Earn up to 1. 5 extra returns Digital Gold Add Indias favourite metal to your portfolio Buy  sell at market prices Earn 1 cashback Start with just 10 Fixed Deposits For slow, steady, and secure investing Earn up to 7. 5 returns Insured up to 5 Lakhs Unlock PRO with an FD Issued By Whats New Mutual Funds Baskets Invest in a balanced mix of different funds Trusted by 30 Lakh Indians Its super easy to invest on Jupiter and it helps me grow savings with confidence. Aravind Shesha I can easily invest in Mutual Funds how I wantdaily, weekly, or monthly. Keara Bakshi Daily SIPs are also easy to set up and manage Madan Qais Frequently Asked Questions What investment options are available on Jupiter? You can invest in the following Mutual Funds Digital Gold Magic Spends Fixed Deposits Do I need to open a Savings Account to Invest on Jupiter? Yes, you need to open a Savings Account to invest in Mutual Funds, Magic Spends or Fixed Deposits. But, you can start investing in Digital Gold even without opening a Savings Account. Is there a fee for investing in Mutual Funds on Jupiter? No, Jupiter doesnt charge any commissions or extra fees on Mutual Funds How do No-Penalty SIPs work on Jupiter ? No-Penalty SIPs let you skip SIPs without having to pay any extra charges What is Magic Spends and how does it work? Magic Spends lets you auto-invest small amounts like 10 or more every time you spend, turning your daily spending into effortless investing. Can I withdraw from Fixed Deposits before maturity? Yes, FlexiFD lets you withdraw money in parts without having to break your full FD. Is my money safe when I invest on Jupiter? Yes. Jupiter partners with trusted AMCs, RBI-regulated entities, and SEBI-compliant platforms to ensure your investments are 100 safe. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Investment Advisers Private Limited",
    "length": 4243
  },
  {
    "url": "https://jupiter.money/mutual-funds/",
    "title": "Mutual Funds",
    "content": "Trusted by 30 Lakh Indians Mutual Funds Grow your wealth on auto-pilot  Invest daily, weekly, or monthly in 1,100 Mutual Funds Download Jupiter Investing has never been easier. Start with just 100 Invest flexibly with as little as 100 and grow your wealth at your pace No penalty on missed SIPs Skip SIPs without any stress and invest the way you want to Earn up to 1. 5 extra returns Invest in Direct Funds on Jupiter and earn extra returns every time Do more with your Mutual Funds Magic Spends Auto-invest in Mutual Funds and gold, every time you spend Track external funds Manage your entire Mutual Funds portfolio in 1 place New on Jupiter Mutual Funds Baskets Diversify your portfolio with a mix of funds Trusted by 30 Lakh Indians Im able to invest stress-free on Jupiter thanks to No-Penalty SIPs Aishwarya Ray The best part about investing on Jupiter is that I never have to pay commissions! Ramanathan TRS SIP reminders on Jupiter have helped me make investing a habit Fatah M Aziz Frequently Asked Questions Am I eligible to invest on Jupiter? Were currently open to folks who have Mutual Fund investment accounts already. If youve invested in Mutual Funds in India, or have signed up to invest on another platform before, youre eligible! Go ahead and sign up on the Jupiter app to get started. In a few weeks, everyone else will also be able to invest on Jupiter  hang in there, and watch this space for updates How do I pay less and earn more using the Jupiter App? On Jupiter, you pay less and earn more on your investments because Jupiter doesnt charge any hidden commissions of 1. 5 over and above your investment amount like other regular funds. Jupiter doesnt charge Penalties of up to Rs 750 that other banks charge in case you miss a SIP because of insufficient balance in your account Whats the difference between a No-Penalty SIP and a Normal SIP? In case you miss a SIP because of insufficient balance in your account, your bank charges you 250750 as Penalty for that missed SIP. Jupiter just smartly skips your SIP! So, there are no Penalty charges What all Mutual Funds does Jupiter have? Jupiter has 1000 Mutual Funds from 39 major AMCs across India. Jupiter only provides growth Direct Mutual Funds which are the best commission-free funds in India What are Mutual Funds? Mutual fund is an investment vehicle that brings together money from many people like you and invests it in stocks, bonds or other assets. Example ICICI Prudential Technology Fund invests your money, majorly in high growth technology companies like Infosys, Wipro, HCL Technologies,etc. Why should I invest with Jupiter Money? Pay less, earn more returns Jupiter doesnt charge any hidden commissions of 1. 5 over and above your investment amount like other regular funds. Jupiter doesnt charge Penalties of up to Rs 750 that other banks charge in case you miss a SIP because of insufficient balance in your account Easy investing Since your Jupiter App is also your investing app - Jupiter doesnt charge any hidden commissions of 1. 5 over and above your investment amount like other regular funds. - Jupiter doesnt charge Penalties of up to Rs 750 that other banks charge in case you miss a SIP because of insufficient balance in your account Easy investing - No-Penalty SIP - If youre ever running low on money in your Jupiter account, we will auto-skip your SIP. This way, there are no Penalty Charges to be paid - One-click SIPs. None of the filling in paperwork and putting down your signature on forms On-Click cancel for any SIP. No questions asked What are Direct Mutual Funds which Jupiter provides? Direct Mutual Funds are Mutual Funds with Zero Commissions or Brokerage charges. 5 extra returns compared to other Mutual Funds Why should I invest in Mutual Funds? You can invest in Mutual funds as You can save upto Rs 46,800 in your taxes every year. Your invested money compounds generating more money for you each year. You learn to save money for your future and build financial discipline Are Mutual Funds regulated? Mutual Fund companies are regulated by Securities and Exchange Board of India SEBI. SEBI falls under the control of the Ministry of Finance of India. I dont know what Mutual Funds to invest in. What do I do? To start investing, its important to know why youre investing. To help you with this, weve created Mutual Funds collections to get you started -  - High Growth - Tax Saving Funds - Better than FD - Low cost index funds - SIP with 500. Here you will find Mutual Funds most relevant to your investment objectives What is the smallest amount I can invest in Mutual Funds? You can start investing in Mutual Funds with as little as Rs. 500 Weve put together a Collection containing all Mutual Funds where you can start investing with Rs 500. Is investing in Mutual Funds difficult? Investing in Mutual Funds is a breeze on Jupiter. All you need to do is - Pick a Mutual Fund of your choice or select one from our curated Collections - Choose between making a SIP or One Time investment - Swipe to pay! - Thats it! Youve made your Mutual Fund investment How long does it take to get started with Mutual Funds on Jupiter? If youre a verified user on the Jupiter app, you can make your investment in under 5 minutes Ive never been charged a Penalty before. Why should I choose No-Penalty SIPs? Its amazing that youve never been charged a Penalty. This shows you have financial discipline. Investing with No-Penalty SIP gives you a sense of freedom. So if ever you have an emergency or want to use your money for another cause, you can simply tap to skip your SIP. The choice rests with you! How is Jupiter not charging the Rs. 250-750 Penalty? Is there any catch or fine-print? When your SIP autopay mandate fails due to insufficient balance, you have to pay a penalty. AMCs dont charge this penalty  banks do. Each bank would have their own penalty charge for not maintaining sufficient funds for the Electronic Clearing Service ECS mandate to go through. This penalty ranges from 250-750. At Jupiter, because you bank and invest on the same app, we smartly pause your SIP for the current month when your Jupiter balance is low. No charges, ever Do you mean I dont get same days NAV elsewhere? Most Mutual Fund investment platforms may take a few working days to allocate units after you place an order. During this time the NAV can change. On Jupiter, youre allotted units as per the NAV you see on the app if you invest before 2 PM on working days. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Investment Advisers Private Limited",
    "length": 8278
  },
  {
    "url": "https://jupiter.money/digi-gold/",
    "title": "Buy 24K Digital Gold Online - Jupiter Money DigiGold",
    "content": "Digital Gold Indias favourite metal, now yours  Buy and sell 24K Digital Gold at live market prices Buy Gold on Jupiter Powered by MMTC-PAMP  TCs apply Pure Secure 24K Digital Gold Start with just 10 Buy Digital Gold with as little as 10 and invest flexibly Auto-invest with SIPs Make saving a habit with daily, weekly, and monthly SIPs Sell instantly, anytime You can sell your Digital Gold at market prices anytime Exclusively on Jupiter Magic Spends Auto-invest in Digital Gold every time you spend Trusted by 30 Lakh Indians I use the rewards I earn on Jupiter to buy Digital Goldand invest extra every month! Mohini Ray After buying Digital Gold at 0 making charges, I dont buy physical gold anymore. Minal Savla I love how I could start with a small amount  gradually build my gold savings. Trusha Patel Frequently Asked Questions What is Digital Gold on Jupiter? Digital Gold on Jupiter allows you to buy and sell 24K gold online at live market prices, starting from as low as 10. Its 100 digital and secure with no making charges. How is my Digital Gold stored? Every gram of Digital Gold you purchase is stored as 24K physical Gold in lifetime-free vaults by our trusted partners. Can I start investing in Gold with just 10? Yes, you can purchase 24K Digital Gold with just 10 or more. You can either make a one-time investment or invest regularly with daily, weekly, and monthly SIPs. Can I sell my Digital Gold anytime? Yes, you can instantly sell your Digital Gold at live market prices from the Jupiter app. Can I get physical delivery of the gold? Currently, Jupiter offers only digital storage of gold. Physical delivery is not available. How is the price of Digital Gold determined? Prices are updated live and reflect the current market rate of 24K gold with no making charges. Why should I invest in Digital Gold? Digital Gold lets you invest in 24K pure gold without worrying about storage or safety. Unlike traditional options, you can start small, track your gold value in real time, and sell it anytime you want. Its a smart way to grow your savings and with Jupiter, the process is completely digital. Can I set up automatic investments in Digital Gold? Yes, you can set up a daily, weekly, or monthly SIP to auto-invest in Digital Gold. You can also set up Magic Spends, a feature exclusively on Jupiter, to auto-invest in Gold every time you spend. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners We always keep your money and data safe with strong encryption and built-in privacy protections. SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. In partnership with MMTC PAMP  Amica Financial Technologies Private Limited",
    "length": 4230
  },
  {
    "url": "https://jupiter.money/flexi-fd/",
    "title": "Flexi FD- Flexible Fixed Deposits with Partial Withdrawals - Jupiter Money",
    "content": "Flexi FD The most calm way to save  On Jupiter, FlexiFD lets you withdraw money in parts, without breaking your full FD Download Jupiter Trusted by 30 Lakh Indians Savings on your terms Withdraw money anytime Instead of breaking your full FD, withdraw parts you need Keep earning returns The parts that stay invested keep earning interest as always Pay lesser withdrawal penalty You only pay penalties on the parts you choose to withdraw Why FlexiFD? Trusted by 30 Lakh Indians FlexiFD has let me set aside my money without the stress of lock-in Nathan FlexiFD has given me more control over my savings than anything else! Ravi The freedom to withdraw money anytime has been a game-changer for me! Suman Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 2502
  },
  {
    "url": "https://jupiter.money/recurring-deposits/",
    "title": "Recurring Deposits: Auto-save for all your goals on Jupiter",
    "content": "Trusted by 30 Lakh Indians Recurring Deposits Auto-save for all your goals  Set aside money daily, weekly, or monthly and earn up to 7. Book a deposit on Jupiter Make saving a habit Start with just 10 Save as little as 10 and increase the amount anytime Save daily, weekly, or monthly Set aside money anytime you want with flexible SIPs Earn assured returns Get up to 7. 5 fixed returns every year and reinvest your interest Trusted by 30 Lakh Indians I was able to save for my first international trip with a Recurring Deposit on Jupiter! Rohit Keeping a weekly SIP helped me save regularly for my Lollapalooza concert tickets! Ayantika Setting aside money for my bike became a habit thanks to the Recurring Deposit Niyati Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 2522
  },
  {
    "url": "https://jupiter.money/money/",
    "title": "Smart Money Tracking: Expenses, Budgets & Reports with Jupiter",
    "content": "Trusted by 30 Lakh Indians Money Track all your bank accounts in 1 place  Stay on top of your money effortlesslysort daily spends, budgets, and future plans in one place. Download Jupiter Get over overspending Categorize every spend No more spreadsheets. Track your spends and top categories in 1 place Set Budgets Reduce overspending in just 1 month. Get notified before you go over your budget. Financial wellness report A mini report card with a summary of your spends, investments, rewards, and more Track everything. Bank accounts Manage all your bank accounts in 1 place Credit Cards Track 10 credit cards and pay bills directly on Jupiter Net Worth Track your investments, EMIs, and your credit score Whats New Credit card tracking See all your credit card spends in 1 place Trusted by 30 Lakh Indians The spending insights are great and I finally feel in control of my money. Saroj Jana I love tracking my expenses on Jupiter. Its super useful in the age of UPI. Sushim Ghatak I can see my total Net Worth across banks. Its perfect for multi-bank users Kumar Tatsat Frequently Asked Questions What can I do in the Money tab on Jupiter? You can track your income, expenses, top categories, upcoming bills, and get smart insights on where your money goes  all in one place. How does Jupiter categorize my spending? Jupiter auto-categorizes your transactions like groceries, food, shopping, etc. using smart tags so you can understand your spending patterns at a glance. Can I track my credit card expenses in the Money tab? Yes, you can link your credit cards and view all your spends, dues, and statements in one place, even if theyre from other banks. What is Account Aggregator and how does it work? Account Aggregator AA is a secure framework regulated by the RBI that lets you link and track balances and payments from all your bank accounts. Rest assured, you stay in control and choose what to share and for how long. Is it safe to link my accounts through Account Aggregator? Yes, its completely safe. Jupiter only accesses your data with your consent via licensed Account Aggregators like Finvu, and cannot access it without your permission. Can I set Budgets in the Money tab? Yes, you can set a monthly Budgets to control overspending and manage your money better every month. Jupiter lets you know when youre about to cross your monthly Budget so you can plan your expenses better! What is Net Worth in Jupiter and how is it calculated? Your Net Worth on Jupiter is the difference between what you own and what you owe. It includes all your linked bank balances, investments like FDs or mutual funds, and credit card dues or loans. When you link external accounts using Account Aggregator, we give you a real-time, 360 view of your true net worth in one simple number. Got questions? Our dedicated support team is here 247 to help. Contact us Contact us We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 4585
  },
  {
    "url": "https://jupiter.money/about-us/",
    "title": "about-us",
    "content": "Whats Jupiter about? Making money empowering For most digitally native Indians, managing money comes with hidden fees, jargon and stress. Unlocking financial wellness - For you! Jupiters mission is simple to improve your financial well-being by giving you complete control over your moneyhelping you track, save and invest with confidence. Track Save Invest Designed for the way you live Life moves fast. Jupiter is built for a digital-first India that expects simplicity, transparency and control - without the fine print. Security you can rely on Trusted Partner Your savings account is hosted on Federal Bank Bank-grade security Your data is 100 protected with end-to-end encryptions that are ISO and PCI compliant Guaranteed Safety Your deposits are insured up to 5,00,000 by DICGC Latest news about Jupiter Jupiter Money appoints Adityan Kayalakal as VP  Head of Marketing May 17, 2025 Storyboard18 Users go from being passive readers into active thinkers Why Zerodha, Groww, Jupiter, CRED are betting big on gamification May 13, 2025 Fortune India Building a neobank is the toughest thing, says Jupiters Jitendra Gupta April 4, 2025 Moneycontrol Jupiter CEO Jitendra Gupta On Going Beyond Bank Tie-Ups, Building Under Regulatory Scrutiny March 4, 2025 inc42 Aurm joins forces with Jupiter to extend financial services January 17, 2025 Business Standard Neobanking startup Jupiter Money gets RBIs nod to start prepaid wallet business December 19, 2024 Moneycontrol Jupiter Moneys affiliate program offers 400 payout December 10, 2024 EarnKaro FY24 Neobank Jupiter trims net loss by 16 to Rs 276 crore  The Arc November 13, 2024 The Arc Jupiters consolidated revenue surges 7X in FY24, cuts losses November 12, 2024 Entrackr Our Investors The Jupiter team is growing Be a part of a 600 member team making money management stress-free for millions of Indians. Explore Careers The Jupiter team is growing Be a part of a 600 member team making money management stress- free for millions of Indians. Explore Careers We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 3729
  },
  {
    "url": "https://jupiter.money/careers/",
    "title": "Careers",
    "content": "Trusted by 30 Lakh Indians Careers Join us as we improve financial wellness for millions  View all openings Anything is possible as long as you aspire and work for it. You have to be relentless and restless to achieve an ambitious goal. Success most times is a factor of sheer hard work and planning. Jitendra Gupta Chief Executive Officer Our DNA The core values that define how we operate, solve problems, reward teams, and make decisions every day Pursue excellence We know our goals and relentlessly pursue them. We dont settle at what we know today. Disagree  commit We always act out of integrity. We speak up and challenge decisions, but with respect. Founders Mindset We take charge. We dont wait to be told what to do. We take action rather than waiting for the right time. Customer first We dont stop at satisfying customers. We want them to feel good about their money. Employee benefits When at Jupiter, we ensure you get what you need to work and live better Inclusive healthcare policy Get a medical insurance policy that takes care of you and your family Mental wellness Speak to expert therapists about anything thats on your mind Flexible time off Disconnect from work, recharge and show re-energised once again In-house library Fuel your curiosity with leadership reads or immerse yourself in fictional worlds Learning and growth Found an interesting project? Ask for a department or role switch Our Leadership Jitendra Gupta Founder  CEO Rohit Kumar Pandey President Our 4-step hiring journey At Jupiter, hiring is human. We keep things simple, thoughtful, and designed to help you thrive. TA Screening Round Quick chat on experience, role fit, salary, and culture alignment Hiring Manager Discussion Exploratory chat case study optional, focused on strategy and problem-solving. Core Expertise Rounds In-depth assessment of your core functional skills. HR Round Final Round Culture fit, career aspirations, compensation discussion, and QA. Explore open roles We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 3692
  },
  {
    "url": "https://jupiter.money/contact-us/",
    "title": "contact-us",
    "content": "Contact Us Chat with us Only for users who have completed onboarding Chat Voice Support Live agent support is available only on weekdays from 9 am to 7 pm, including all national holidays 080-44353535 Grievance Redressal policy We work with trusted partners Jupiter deploys high level security standards to keep your money safe SECURITY PARTNERS BANKING AND PAYMENT PARTNERS Amica Financial Technologies Private Limited Jupiter is not a bank and does not hold or claim to hold a banking license. Products and services on the Jupiter platform are offered in partnership with regulated entities. Savings accounts, fixed and recurring deposits, and co-branded debitcredit cards are issued by partner banks including Federal Bank, CSB Bank, and other partner banks authorised by the Reserve Bank of India RBI from time to time. The Jupiter Account is a Prepaid Payment Instrument issued by Amica Payment Services Private Limited, a wholly owned subsidiary of Jupiter and an RBI-authorised PPI issuer License No. Jupiter is also a TPAP registered with NPCI for enabling UPI services. Loan products are facilitated in partnership with RBI-registered NBFCs including Amica Finance Private Limited NBFC Registration No. 02457 and Kisetsu Saison Finance India Private Limited, with Jupiter acting as a Digital Lending App DLA and Loan Service Provider LSP. Mutual fund investments are offered through Amica Investment Advisers Private Limited, a SEBI-registered Investment Adviser INA000015507 and AMFI-registered EOP platform CAT1 EOP-0005. Digital gold is offered in partnership with MMTC-PAMP India Private Limited, health insurance in partnership with authorised entities, and prepaid gift cards in partnership with Pine Labs Private Limited. All products are subject to the terms and conditions of the respective regulated partners, and users are advised to read relevant product documents carefully. Amica Financial Technologies Private Limited",
    "length": 1941
  },
  {
    "url": "https://jupiter.money/blog/",
    "title": "Personal Finance, FinTech Updates from Jupiter | Jupiter",
    "content": "Personal Finance, FinTech Updates from Jupiter  Jupiter Reading  Resources All Building Jupiter Credit and Loan Credit Card Digital Banking Digital Gold Featured Finance Financial Planning Fixed Deposit International Money Transfer Investments Money Money Management Mutual Fund Personal Finance Personal Loan RuPay Credit Card Salary Saving Tax Uncategorized Filter by Categories Tags Authors Show all All Building Jupiter Credit and Loan Credit Card Digital Banking Digital Gold Featured Finance Financial Planning Fixed Deposit International Money Transfer Investments Money Money Management Mutual Fund Personal Finance Personal Loan RuPay Credit Card Salary Saving Tax Uncategorized All All Aastha Sood Aditya Padmawar Colin DSouza Prithvi Tejavath Priyanka Sharma Priyanka Rao Vivek Agarwal June 1, 2025 Credit Card Best RuPay Credit Cards in India for 2025 Published by Priyanka Rao and Priyanka Sharma on June 1, 2025 Categories Credit Card For years, Visa and Mastercard have been the dominant players in the Indian credit card market. However, with the introduction of RuPay, a domestic card network,  Do you like it? 0 Read more June 1, 2025 Credit Card 11 Best RuPay Credit Card Lifetime Free in India 2025 Published by Priyanka Rao and Priyanka Sharma on June 1, 2025 Categories Credit Card RuPay Credit Card RuPay is rapidly gaining popularity in India due to its compatibility with UPI payments and the attractive offers it provides to users. As a home-grown payment  Do you like it? 0 Read more April 9, 2025 Salary Salary Increment Letter Free Download, Writing Format  Templates Published by Priyanka Rao and Colin DSouza on April 9, 2025 Categories Salary A salary increment letter is a formal request made by an employee to seek a pay raise. It emphasizes achievements, contributions, and justifications for the increase while maintaining  Do you like it? 0 0 Read more April 9, 2025 Salary What Is Fixed and Variable Salary? Meaning, Differences and Ways to Calculate Your Salary Published by Priyanka Rao and Colin DSouza on April 9, 2025 Categories Salary As an employee, its important to understand the different components of your income statement and one of the most critical terms is basic salary. This is  Do you like it? 0 0 Read more April 8, 2025 Salary Salary Certificate Format in Word and PDF Free Downloadable Template Published by Priyanka Rao and Colin DSouza on April 8, 2025 Categories Salary A salary certificate is a letter issued by an employer stating the income and job details of an employee. It contains the name of the employee, designation, employee ID, joining date, and salary break-up. Also, it comprises details of the employer, such as the name  Do you like it? 0 0 Read more April 8, 2025 Salary What is PF in Salary  Meaning, Full Form  Calculations in Employee Provident Fund Published by Priyanka Rao and Colin DSouza on April 8, 2025 Categories Salary In salary terms, PF means Provident Funda retirement savings where both employee and employer contribute. In the realm of employment and remuneration, it is essential to  Do you like it? 0 0 Read more April 7, 2025 Money Management Best Money Transfer Apps in India With Play Store Ratings  Top 25 Apps Published by Priyanka Rao on April 7, 2025 Categories Money Management Currently, money transfer is one of the most popular services in the world. It allows you to send money from one place to another, even in  Do you like it? 0 Read more April 7, 2025 Finance Explained Law of Diminishing Marginal Utility With Diagram Published by Priyanka Rao on April 7, 2025 Categories Finance Want to understand the law of diminishing marginal utility? Click here to read about marginal utility, types of marginal utility along with suitable examples. Do you like it? 31 Read more April 2, 2025 Personal Finance Best Bank For Salary Account In India Published by Priyanka Rao and Colin DSouza on April 2, 2025 Categories Personal Finance Planning to open a salary ccount in 2022? Here is a list of best banks that offer the best benefits and features for opening a salary account. Do you like it? 31 Read more April 1, 2025 Salary What is DA in Salary? Understanding Dearness Allowance Published by Priyanka Rao and Colin DSouza on April 1, 2025 Categories Salary In terms of employment, people in India work in both the public and private sectors. Recent estimates indicate that 6. 8 million people receive government pensions, including  Do you like it? 0 0 Read more April 1, 2025 Digital Gold Best Gold Investment Apps To Buy Digital Gold Online in India Published by Priyanka Rao and Aastha Sood on April 1, 2025 Categories Digital Gold Gold has been one of the first investment options for generations now. It is the first thing that comes to a persons mind when they have  Do you like it? 2 0 Read more March 31, 2025 Money Management Best Expense Tracker Apps in India  Personal Expense Tracker Apps Published by Priyanka Rao on March 31, 2025 Categories Money Management Personal Finance In order to manage your money better, you need to find the best expense tracker app in your app store or play store. Tracking personal expenses  Do you like it? 0 0 Read more March 27, 2025 Credit and Loan What is Disbursement  Definition, How It Works, Types, Examples Published by Priyanka Rao on March 27, 2025 Categories Credit and Loan Businesses should understand various payment-associated processes to avoid any hassles. Non-compliance or errors may result in penalties, failed audits, and other charges. Therefore, while making payments  Do you like it? 0 Read more March 27, 2025 Money Management Overspending  Psychology, Meaning, Reasons, And Techniques to Stop Published by Priyanka Rao on March 27, 2025 Categories Money Management In todays world, where everything is digitized, shopping has become way easier than it was before. With one-click purchases, and same-day delivery options, the convenience of  Do you like it? 0 Read more March 27, 2025 Salary Remuneration, Salary, And Compensation  Definition, Meaning, and Types Published by Priyanka Rao and Colin DSouza on March 27, 2025 Categories Salary As an employer, it is important to know that compensation to your personnel includes more than their basic pay. It comprises several potentially taxable benefits. Having  Do you like it? 0 Read more March 26, 2025 Personal Finance What is Salary Slip- Components of Salary Slip, Format  Payslip Breakdown Published by Priyanka Rao and Colin DSouza on March 26, 2025 Categories Personal Finance Important Things to Know About Salary Slip A salary pay slip is a document that every salaried individual receives from his or her employer, but  Do you like it? 0 Read more March 25, 2025 Digital Banking What Is Savings Account Types  Benefits Of Savings Account Published by Priyanka Rao on March 25, 2025 Categories Digital Banking What is a savings account? Click here to find out the features  benefits of savings account, eligibility, documents required  process to apply for a savings account. Do you like it? 31 Read more March 25, 2025 Digital Banking How To Open A Bank Account In India Online  Offline Process Published by Priyanka Rao on March 25, 2025 Categories Digital Banking Looking for information on how to open a bank account in India? Click here for the online  offline process of opening a bank account, its eligibility criteria  documents needed Do you like it? 32 Read more March 24, 2025 Salary What To Do With My First Salary? 9 Easy Things Published by Priyanka Rao and Colin DSouza on March 24, 2025 Categories Salary Receiving your first salary is an exciting milestone that marks the beginning of a new phase in your life. It not only brings a sense of  Do you like it? 0 0 Read more January 31, 2025 Credit Card 15 Best Airport Lounge Access Credit Cards in India 2025 Published by Priyanka Rao and Priyanka Sharma on January 31, 2025 Categories Credit Card Credit cards provide various advantages that can make your travels more affordable and convenient. One key benefit is complimentary airport lounge access, which allows you to  Do you like it? 0 Read more January 27, 2025 Credit Card How to Get Credit Card Without CIBIL Score? Published by Priyanka Rao and Priyanka Sharma on January 27, 2025 Categories Credit Card No CIBIL score? No problem! You might think that securing a credit card is impossible without a stellar credit history, but thats not entirely true. Many  Do you like it? 0 Read more January 27, 2025 Credit Card Best Credit Cards for Movie Tickets  OTT Subscriptions in India 2025 Published by Priyanka Rao and Priyanka Sharma on January 27, 2025 Categories Credit Card Are you a movie buff who loves catching the latest blockbusters? If so, you probably know that enjoying a night out at the cinema can quickly  Do you like it? 0 Read more January 23, 2025 Credit Card 8 Best RuPay Fuel Credit Cards in India 2025 Published by Priyanka Rao and Priyanka Sharma on January 23, 2025 Categories Credit Card Are you tired of the hassle of carrying cash or juggling multiple cards for your daily fuel expenses? A fuel credit card can simplify your life  Do you like it? 0 Read more January 15, 2025 Personal Loan Top 9 Personal Loan Apps Without CIBIL Score Published by Priyanka Rao and Aditya Padmawar on January 15, 2025 Categories Personal Loan Getting a personal loan can feel like a mountain to climb, especially if your CIBIL score isnt what youd like it to be. But dont worry  Do you like it? 0 Read more January 12, 2025 Credit Card Credit Card Disadvantages and Advantages Everything Should Know Published by Priyanka Rao and Priyanka Sharma on January 12, 2025 Categories Credit Card Credit cards have become a popular way to pay for things. They offer benefits like easy credit, discounts, rewards, and can help build a good credit  Do you like it? 1 0 Read more January 11, 2025 Credit and Loan      Credit Card Kya Hota Hai        ? Published by Priyanka Rao and Priyanka Sharma on January 11, 2025 Categories Credit and Loan          Credit Card                 Do you like it? 1 0 Read more December 17, 2024 Investments New Pension Scheme and National Pension Scheme  Tax Benefits, Charges, and More Published by Priyanka Rao on December 17, 2024 Categories Investments The National Pension System NPS was launched by the government in 2004, primarily for government employees. In 2009, it was made available to all citizens. You  Do you like it? 0 Read more December 17, 2024 Personal Finance Income Tax Exemptions with Limits for Salaried Employees Published by Priyanka Rao on December 17, 2024 Categories Personal Finance Tax As the end of the financial year comes closer, it is time to look at your tax liabilities and start preparing to file the Income Tax  Do you like it? 0 Read more December 16, 2024 Personal Finance Form 26AS Download  What Is It? How You Can Download? Published by Priyanka Rao on December 16, 2024 Categories Personal Finance This Tax Credit Statement form is an important document for taxpayers. It reflects the total tax paid to the Income Tax IT Department by you and  Do you like it? 0 Read more December 11, 2024 Fixed Deposit Fixed Deposit Monthly Income Scheme  What is Monthly Payout in FD? Published by Priyanka Rao on December 11, 2024 Categories Fixed Deposit Creating a source of secondary income is always good. It helps you save more and also covers your unexpected expenses. There are many ways you could  Do you like it? 0 Read more December 10, 2024 Finance What is Statutory Liquidity Ratio? Current SLR Rate and More Published by Priyanka Rao on December 10, 2024 Categories Finance Want to know about SLR? Click here to read an in-depth guide to the statuary liquidity ratio,its pivotal impact on investments  penalties to avoid in maintaining SLR. Do you like it? 31 Read more December 5, 2024 Personal Loan What is Personal Loan Balance Transfer? Published by Priyanka Rao on December 5, 2024 Categories Personal Loan If you start feeling that your personal loan is taking up too much of your monthly budget, you can consider going for a balance transfer. By  Do you like it? 0 Read more November 29, 2024 Personal Loan How to Check My All Loan Details by Pan Number? Published by Priyanka Rao on November 29, 2024 Categories Personal Loan If youve taken out a loan, you might be wondering how to keep track of all your details, especially when it comes to your PAN number. Do you like it? 0 Read more November 29, 2024 Personal Loan What Is the Maximum Loan Duration for the Personal Loan? Published by Priyanka Rao on November 29, 2024 Categories Personal Loan The loan term you choose can have a major impact on your monthly payments and your overall finances. Its an important decision because it affects how  Do you like it? 0 Read more November 28, 2024 Credit and Loan What is Retail Loan? its Meaning, Types, Benefits Published by Priyanka Rao on November 28, 2024 Categories Credit and Loan In the world of personal finance, retail loans have become a crucial pillar. They allow you to meet a variety of financial demands without draining your  Do you like it? 0 Read more November 28, 2024 Credit and Loan What is Digital Lending  How Digital Lending Is Changing India Published by Priyanka Rao on November 28, 2024 Categories Credit and Loan In a technologically driven world, traditional means of obtaining money are drastically altered. Digital lending has emerged as a critical factor in the financial landscape, transforming  Do you like it? 0 Read more November 28, 2024 Personal Loan Personal Loan Insurance Should You Get It? Published by Priyanka Rao on November 28, 2024 Categories Personal Loan Picture this Youve taken out a personal loan for a major life event or maybe just to cover some unexpected expenses. Youre ready to manage the  Do you like it? 0 Read more November 28, 2024 Personal Loan How to Check Loan Status? Published by Priyanka Rao on November 28, 2024 Categories Personal Loan There are many instances in our lives where we must apply for loans to fulfil our financial needs. A personal loan is one of the most  Do you like it? 0 Read more November 27, 2024 Credit and Loan Loan Against Mutual Funds What is It? How to Get Loan Against Securities? Published by Priyanka Rao and Vivek Agarwal on November 27, 2024 Categories Credit and Loan During an emergency, we experience a money crunch and tend to take out money from our savings, liquidate our investments, or take a loan. However, instead  Do you like it? 0 0 Read more 1 2 3 4 5 6 7 8 9 Next page Download Jupiter 3-in-1 Switch RuPay Credit Card Lifetime Free 2 cashback Pay on UPI with Credit Card Powerd by Issued by Check credit limit in 30 sec",
    "length": 14769
  },
  {
    "url": "https://jupiter.money/calculators/",
    "title": "Personal Finance, FinTech Updates from Jupiter (Page 1)",
    "content": "Personal Finance, FinTech Updates from Jupiter Page 1",
    "length": 53
  },
  {
    "url": "https://jupiter.money/calculators/home-loan-emi-calculator/",
    "title": "Home Loan Calculator - Free EMI Calculator For Home Loan",
    "content": "Back to calculators Back Home Loan EMI Calculator IN THIS ARTICLE More EMI Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator Other Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator Taking out a home loan is a significant financial decision, one that requires careful planning and consideration. Whether youre a first-time homebuyer or looking to refinance, understanding your monthly commitments is crucial. Thats where a Home Loan EMI Calculator becomes a useful tool. This calculator not only helps you estimate your monthly payments but also empowers you to make informed financial decisions with ease. What is a Home Loan EMI Calculator? A Home Loan EMI Calculator is a convenient online tool designed to help you calculate your monthly home loan payments. This home loan prepayment calculator acts as your personal loan advisor, helping you estimate the exact amount youll need to pay each month EMI to repay your home loan. By using this calculator, you can Plan Your Budget Get a clear picture of how much you can afford to borrow based on your financial situation. Compare Loan Offers Evaluate different loan options by comparing interest rates and EMIs from various lenders. Visualize Long-Term Costs Understand the total repayment amount over the loan tenure, including both principal and interest, to make better financial decisions. How to Use a Home Loan Calculator? Step-by-Step Guide Using a home loan EMI calculator is easy and can help you get a quick estimate of your monthly loan payments. Heres how it works Enter Loan Amount Start by entering the total sum of money you plan to borrow for your home loan. This is known as the principal loan amount. Enter Interest Rate Next, input the annual interest rate offered by your lender. This rate is typically a percentage. Be sure to confirm if its a fixed or adjustable rate. Enter Loan Tenure Input the timeframe for repaying the loan, usually specified in years. The chosen tenure significantly impacts your monthly EMI. Longer tenures result in lower EMIs, while shorter tenures lead to higher EMIs. Add Pre-Payment Amount if applicable Now, enter the amount you wish to pre-pay, if any, and related information or skip this step. Add Processing Fee Amount if applicable Next, enter the processing fee amount. Calculate Your EMI Once youve entered all the details, the home loan emi prepayment calculator will process this information and quickly generate your EMI payment table or amortisation schedule. Review Your Results The EMI calculator amortisation table provides insights into several key aspects Monthly EMI This is the fixed amount youll pay each month. Principal Amount This shows the total principal amount youll pay over the entire loan tenure. Total Interest Payable This shows the total interest youll pay over the entire loan tenure. Pre-payment This is the amount you have chosen to pay ahead and have entered into the calculator. Total Payment Principal  Interest  Pre-payment This is the sum of the principal loan amount, the total interest payable and your pre-payment amount. Loan Paid to Date This reflects the loan you have paid and can help you figure out your outstanding loan balance after each EMI payment, allowing you to track the remaining loan amount over time. Common Home Loan EMI values Note We have considered the interest rate at 8. 75 for the home loan EMI calculations. Use this for informational purposes only. To know how to save on interest amount, check the insights on the Home Loan EMI calculator above. Amount Duration Years EMI Equated Monthly Instalments Total Amount to be Paid Principal  Interest 10 lakh home loan for 5 years 5 20,637 12,38,234 10 lakh home loan emi for 10 years 10 12,533 1,53,921 10 lakh home loan emi for 15 years 15 9,994 17,998 10 lakh home loan emi for 20 years 20 8,837 21,20,906 10 lakh home loan emi for 30 years 30 7,867 28,32,121 12 lakh home loan emi for 5 years 5 24,765 14,85,881 12 lakh home loan emi for 10 years 10 15,039 1,84,705 12 lakh home loan emi for 15 years 15 11,993 21,58,809 12 lakh home loan emi for 20 years 20 10,605 2,54,587 14 lakh home loan emi for 20 years 20 12,372 29,69,268 15 lakh home loan emi for 5 years 5 30,956 18,57,351 15 lakh home loan emi for 7 years 7 23,944 20,11,274 15 lakh home loan emi for 10 years 10 18,799 22,55,882 15 lakh home loan emi for 15 years 15 14,992 26,98,511 15 lakh home loan emi for 20 years 20 13,256 31,81,359 15 lakh home loan emi for 25 years 25 12,332 36,99,646 15 lakh home loan emi for 30 years 30 11,801 42,48,182 16 lakh home loan emi for 10 years 10 20,052 2,46,274 17 lakh home loan emi for 10 years 10 21,306 25,56,666 17 lakh home loan emi for 20 years 20 15,023 3,65,540 18 lakh home loan emi for 10 years 10 22,559 27,758 18 lakh home loan emi for 20 years 20 15,907 38,17,630 19 lakh home loan emi for 20 years 20 16,791 40,29,721 20 lakh home loan emi for 5 years 5 41,274 24,76,468 20 lakh home loan emi for 10 years 10 25,065 3,07,842 20 lakh home loan emi for 15 years 15 19,989 3,59,815 20 lakh home loan emi for 20 years 20 17,674 42,41,811 20 lakh home loan emi for 25 years 25 16,443 49,32,862 20 lakh home loan emi for 30 years 30 15,734 56,64,243 21 lakh home loan emi for 20 years 20 18,558 44,53,902 22 lakh home loan emi for 20 years 20 19,442 46,65,993 23 lakh home loan emi for 20 years 20 20,325 4,87,883 24 lakh home loan emi for 20 years 20 21,209 50,90,174 25 lakh home loan emi for 5 years 5 51,593 30,95,585 25 lakh home loan emi for 7 years 7 39,906 33,52,123 25 lakh home loan emi for 10 years 10 31,332 37,59,803 25 lakh home loan emi for 15 years 15 24,986 44,97,519 25 lakh home loan emi for 20 years 20 22,093 5,32,264 25 lakh home loan emi for 25 years 25 20,554 6,16,677 25 lakh home loan emi for 30 years 30 19,668 70,80,304 26 lakh home loan emi for 20 years 20 22,976 55,14,355 27 lakh home loan emi for 20 years 20 23,860 57,26,445 28 lakh home loan emi for 20 years 20 24,744 59,38,536 29 lakh home loan emi for 20 years 20 25,628 61,50,627 30 lakh home loan emi for 5 years 5 61,912 37,14,702 30 lakh home loan emi for 10 years 10 37,598 45,11,763 30 lakh home loan emi for 15 years 15 29,983 5,39,723 30 lakh home loan emi for 20 years 20 26,511 63,62,717 30 lakh home loan emi for 25 years 25 24,664 73,99,293 30 lakh home loan emi for 30 years 30 23,601 84,96,364 35 lakh home loan emi for 10 years 10 43,864 52,63,724 35 lakh home loan emi for 15 years 15 34,981 62,96,526 35 lakh home loan emi for 20 years 20 30,930 74,23,170 35 lakh home loan emi for 25 years 25 28,775 86,32,508 35 lakh home loan emi for 30 years 30 27,535 99,12,425 40 lakh home loan emi for 5 years 5 82,549 49,52,936 40 lakh home loan emi for 10 years 10 50,131 60,15,684 40 lakh home loan emi for 15 years 15 39,978 7,19,630 40 lakh home loan emi for 20 years 20 35,348 84,83,623 40 lakh home loan emi for 25 years 25 32,886 98,65,724 40 lakh home loan emi for 30 years 30 31,468 1,13,28,486 45 lakh home loan emi for 10 years 10 50,131 60,15,684 45 lakh home loan emi for 20 years 20 35,348 84,83,623 45 lakh home loan emi for 30 years 30 31,468 1,13,28,486 50 lakh home loan emi for 5 years 5 1,03,186 61,91,170 50 lakh home loan emi for 10 years 10 62,663 75,19,605 50 lakh home loan emi for 15 years 15 49,972 8,99,538 50 lakh home loan emi for 20 years 20 44,186 1,64,529 50 lakh home loan emi for 25 years 25 41,960 1,25,87,945 50 lakh home loan emi for 30 years 30 40,231 1,44,83,207 60 lakh home loan emi for 10 years 10 75,196 90,23,526 60 lakh home loan emi for 15 years 15 59,967 1,79,445 60 lakh home loan emi for 20 years 20 53,023 1,27,25,434 60 lakh home loan emi for 25 years 25 49,329 1,47,98,585 60 lakh home loan emi for 30 years 30 47,202 1,69,92,729 70 lakh home loan emi for 10 years 10 87,729 15,27,447 70 lakh home loan emi for 15 years 15 69,961 12,59,353 70 lakh home loan emi for 20 years 20 61,860 1,48,46,340 70 lakh home loan emi for 30 years 30 55,069 1,98,24,850 75 lakh home loan emi for 20 years 20 66,278 15,96,793 80 lakh home loan emi for 20 years 20 70,697 1,69,67,246 80 lakh home loan emi for 25 years 25 65,771 1,97,31,447 80 lakh home loan emi for 30 years 30 62,936 2,26,56,972 How to Calculate Home Loan EMI? EMIs are calculated using a formula that considers three key factors 1. Principal Loan Amount P The total amount you borrow from the lender. Interest Rate R The annual interest rate charged by the lender on the loan amount. Loan Tenure N The total duration in years for which you repay the loan. The EMI calculation is based on a standard mathematical formula EMI  P x R x 1RN  1RN - 1 Document The EMI calculation is based on a standard mathematical formula EMI  P  r  1 r  n 1 r  n -1 Where PPP is the principal loan amount r is the monthly interest rate annual interest rate divided by 12 and then by 100 n is the loan tenure in months loan tenure in years multiplied by 12 Explanation with an Example Lets consider an example to illustrate the calculation Loan Amount P 30,00,000 Annual Interest Rate 8 Loan Tenure 20 years Step 1 Convert the annual interest rate to a monthly rate r  8 12  100  0. 00667 Step 2 Convert the loan tenure to months n  20  12  240 Step 3 Plug these values into the formula EMI  30,00,000  0. 00667  240 -1 Step 4 Calculate the EMI EMI  30,00,000  0. 9307 EMI  25,100 So, the monthly EMI for a loan amount of 30,00,000 at an 8 annual interest rate over 20 years would be approximately 25,100. Benefits of Using a Prepayment Calculator for Home Loan Quick and Convenient Using a home loan EMI calculator is straightforward. Just enter some basic details, and youll get your results in seconds. Plus, its completely free and doesnt require any registration. Accurate Estimates Get reliable results without any manual calculation errors. Compares Loan Offers Easily compare different loan options side-by-side to find the best fit for your needs. Detailed Breakdown See a clear picture of how your repayments will be structured, including EMI amounts. Plan Your Tenure The calculator can help you choose a loan term that aligns with your financial situation. Home Loan EMIs Payment Options Online Transfers with Net Banking Pay your EMI through online platforms from your computer or phone using your banks mobile app. Ensure a secure internet connection and follow your banks instructions for security. Unified Payments Interface UPI Connect your bank account to a UPI app and make payments quickly and easily. UPI offers instant and secure transfers. In-Person Payments at the Bank Visit your bank branch to make your payment over the counter. This allows you to speak with a bank representative if you have any questions. ECS Electronic Clearing Service Authorise your bank to automatically deduct the EMI amount from your account on the due date, eliminating the need for paper checks or visiting a branch. Mobile Wallets Use mobile wallet apps to manage your EMI payments. These apps offer features like transaction history, alerts, and reminders. Cheque Payments Submit a cheque for your EMI payment at the bank branch. Cheques provide a physical record of payment but can be slower due to processing times. Electronic Standing Instruction e-Mandate Set up automated payments through e-Mandate for recurring payments. It combines the ease of automatic deductions with the speed of online platforms. National Automated Clearing House NACH Similar to ECS, NACH handles large numbers of transactions electronically. Authorise your bank to automatically deduct your EMI payment. Charges Applicable on Non-payment of Home Loan EMIs Late Payment Penalties and Fees Missing an EMI payment can result in late fees, interest on the overdue amount, and other penalties depending on your lenders policies. Typically, late fees range from 1 to 2 of the EMI amount due. NACHSICheque Bounce Charges These charges apply when a home loan payment fails due to insufficient funds in the linked account or if the account is closed. Negative Impact on Credit Score Making on-time payments helps build a good credit score. Missing a payment can lower your credit score significantly and affect the credit score of someone who co-signed your loan application. Can Affect Transfer Eligibility Missed payments can make it harder to qualify for a balance transfer to a new lender with a lower interest rate. Non-Performing Asset NPA Status If you miss your first two loan payments, your lender will send reminders. If you havent made a payment in 90 days, your loan may be classified as a Non-Performing Asset NPA. Increased Costs for Subsequent EMI Payments Missing a home loan EMI can result in increased future payments due to added late fees and penalties. What Factors Affect Your Home Loan EMI? Loan Amount Principal The total sum you borrow for your home purchase. A larger loan amount translates to a higher EMI payment. Interest Rate The interest rate offered by the bank determines how much you pay in addition to the loan amount. A higher interest rate translates to a higher EMI. Processing Fee The processing fee covers the cost of reviewing your home loan application. Its usually a percentage of the loan amount or set as a fixed fee. Loan Tenure Longer loan tenures result in lower monthly EMIs but higher total interest paid over time. Shorter tenures lead to higher monthly EMIs but lower total interest. Prepayments Making extra payments towards your home loan can significantly impact your EMIs. These prepayments reduce the outstanding principal amount, leading to lower EMIs. What are Flexible and Fixed Home Loan EMIs? While most home loan EMIs are fixed throughout the loan term, they might change in some situations Flexible Home Loan EMIs Step-up loans gradually increase your EMI amount over the loan term, while step-down loans see a decrease in EMI as time goes on. Partly Disbursed Loan You may encounter pre-EMIs initially if your loan is disbursed in stages. Impact of Rising Floating Interest Rates If the repo rate changes, it can affect your floating interest rate. If the interest rate goes up, your lender might extend your loan term or increase your EMI. Home Loan Prepayment Making additional payments towards your home loan principal can affect your EMIs. You can lower your EMI amount or shorten the loan term. Frequently Asked Questions FAQs What is a home loan amortisation schedule? A home loan amortisation schedule is a detailed breakdown of your monthly loan payments over the entire loan term, showing how much goes towards interest and how much towards reducing the principal loan amount. Is a home loan EMI calculator accurate? Home Loan EMI calculators are generally very accurate but should be used as an estimate. The actual EMI might differ slightly due to factors like rounding and processing fees. Is it free to use Jupiters home loan EMI Calculator? Yes, Jupiters Home Loan EMI Calculator is completely free to use. Is GST applicable to home loan EMI? No, GST is not applicable to the EMI amount itself. However, GST might be levied on processing fees or other charges associated with the home loan. What is the eligibility criteria for getting a home loan? Eligibility criteria vary by lender but generally consider your income, credit score, employment status, and down payment amount. What happens if the home loan EMI is not paid? Late or missed EMI payments can damage your credit score and lead to late payment penalties. In severe cases, the lender may repossess the property. Does home loan EMI change with the increase in home loan interest rates? No, your EMI amount typically remains fixed for the entire loan term with a fixed interest rate. However, with adjustable-rate mortgages, your EMI can fluctuate if the interest rate changes. What are the different types of home loans available? Several home loan types exist, including fixed-rate, adjustable-rate, and special programs for first-time homebuyers. Is it possible to change my home loan EMI amount during the loan tenure? Yes, your EMI can change in some cases, such as with adjustable-rate mortgages or if you make additional principal payments. What are the tax benefits of paying home loan EMIs? In many countries, you can deduct a portion of the interest paid on your home loan from your taxable income. What is the EMI for a 20 Lakh home loan? Use a home loan EMI calculator to estimate your EMI for a specific loan amount, interest rate, and loan term. How to pay extra EMI for home loan? Most lenders allow you to make additional principal payments towards your home loan. Contact your lender to learn about their specific process. When does home loan EMI start for under construction property? For under-construction properties, EMI payments often start after construction is complete and the property is ready for possession. There might be a pre-EMI interest charged during the construction phase. Can I pay home Loan EMI through credit card? Generally, paying your home loan EMI through a credit card is not advisable due to high credit card interest rates. Additionally, not many lenders offer this option. Can we stop home loan EMI for a few months? Most lenders dont offer the option to completely stop EMI payments. However, some might offer loan modification programs that could temporarily reduce your EMI amount. How to reduce EMI of existing home loan? There are ways to potentially reduce your EMI , such as refinancing your loan at a lower interest rate or making a larger down payment. When does my home loan EMI start? The start of your EMI payments typically depends on the loan type and property status. For already constructed properties, EMIs usually begin one month after loan disbursal. What is a pre-EMI interest on a home loan? Pre-EMI interest is the interest charged on the disbursed loan amount during the construction period of an under-construction property. How does your home loan repayment work? Your home loan repayment consists of monthly payments that include both principal and interest. The portion towards principal increases and the interest portion decreases over time. How much home loan am I eligible for? The maximum home loan amount you can qualify for depends on several factors, including your income, credit score, existing debts, and the lenders policies. Use a home loan eligibility calculator to get a starting estimate. Are there any hidden fees associated with a home loan? While the base interest rate is crucial, there can be additional charges like processing fees, valuation charges, and legal and documentation charges. How much is 10 lakh home loan EMI? The EMI for a loan amount of  10 lakh will be 7,867 for a tenure of 30 years OR 12,533 for 10 years at 8. An EMI on a loan amount of Rs. 10 Lakh will be dependent on the number of years the loan is taken for and the rate of interest set by the Banks or financial institutions. How much is 20 lakh home loan EMI? The EMI for a loan amount of  20 lakh will be 15,734 for a tenure of 30 years OR 25,065 for 10 years at 8. An EMI on a loan amount of Rs. 20 Lakh will be dependent on the number of years the loan is taken for and the rate of interest set by the Banks or financial institutions. How much is 30 lakh home loan EMI? The EMI for a loan amount of  30 lakh will be 23,601 for a tenure of 30 years OR 37,598 for 10 years at 8. An EMI on a loan amount of Rs. 30 Lakh will be dependent on the number of years the loan is taken for and the rate of interest set by the Banks or financial institutions. How much is 40 lakh home loan EMI? The EMI for a loan amount of  40 lakh will be 31,468 for a tenure of 30 years OR 50,131 for 10 years at 8. An EMI on a loan amount of Rs. 40 Lakh will be dependent on the number of years the loan is taken for and the rate of interest set by the Banks or financial institutions. How much is 50 lakh home loan EMI? The EMI for a loan amount of  50 lakh will be 40,231 for a tenure of 30 years OR 62,663 for 10 years at 8. An EMI on a loan amount of Rs. 50 Lakh will be dependent on the number of years the loan is taken for and the rate of interest set by the Banks or financial institutions. In this article Calculators Similar articles that might interest you!",
    "length": 23287
  },
  {
    "url": "https://jupiter.money/calculators/national-pension-scheme-calculator/",
    "title": "NPS Calculator Online for National Pension Scheme - Jupiter",
    "content": "Back to calculators Back National Pension Scheme Calculator IN THIS ARTICLE More EMI Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator Other Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator What is NPS? The National Pension System NPS, previously known as National Pension Scheme, is an investment instrument offered by the Central Government. The Pension Fund Regulatory and Development Authority PFRDA regulates the NPS, ensuring maximum security. You may invest in NPS regularly during your working years and create substantial wealth for retirement. Once you retire, a portion of the accumulated maturity amount will become available for withdrawal. And you will receive the rest as a monthly pension. Any Indian resident can invest in NPS. You can benefit from this pension scheme if you are a government, private or unorganized sector employee. But, before investing in NPS, you must learn how the scheme works. To understand this, use an NPS calculator online to get an idea about the returns the scheme can generate. The benefits of NPS NPS has become a popular investment avenue over the last few years due to its substantial returns and security. The scheme offers many other benefits that make it a suitable investment option for everyone. Here are five noteworthy advantages of NPS. High returns When investing to build a retirement fund, your focus should be to earn high returns. And NPS can offer that as it has historically provided 8 to 10 annual interest for more than a decade. When you invest in NPS, the fund managers put a portion of the money in equity-based investment options. That is how NPS generates higher returns than most other tax-saving schemes. Additionally, if you are not satisfied with the returns, the scheme allows you to change the fund manager as well. Stabilized risk Equity-linked investment products are generally risky as market volatility can affect their returns. But NPS is a safe option as the scheme systematically stabilizes the risk. If you are a government employee, NPS allows you to invest only up to 50 of your total fund in equities. The limit is between 50 and 70 for non-government employees. After you reach 50 years, the schemes equity exposure automatically starts to reduce by 2. If you are 60 years or more, the equity exposure limit will become fixed at 50. This systematic stabilization balances risk and returns, ensuring that your money is safe. If all these seem too complicated, you can use a National Pension Scheme calculator. It will quickly give you a maturity amount estimation without any hassles. Tax benefits One benefit of NPS that makes it lucrative is the tax deductions it offers. The contributions you and your employer make towards NPS are tax-deductible up to 1. The self-contributed amount is tax exemptible under subsection 80CCD 1 of Section 80C of the Income Tax Act, 1961. The deduction limit is 10 of your salary or 1. 5 lakhs, whichever is lower. The tax benefit for the employers contribution is covered under Section 80CCD 2. If you are self-employed, the tax deduction limit is 20 of your gross income under subsection 80CCD 1. But you will not get any exemption under Section 80CCD 2. Under Section 80CCD 2, the tax deduction limit is whichever is the lowest from the following. Employers NPS contribution Total gross income 10 of basic pay and Dearness Allowance DA Additionally, Section 80CCD 1B allows a tax deduction of up to 50,000 on your contribution to the NPS account. So, you can get a total tax exemption of up to 2 lakhs using the benefits offered by Sections 80CCD 1 and 80CCD 1B. Emergency withdrawal You may withdraw up to 60 of your accumulated NPS fund after the age of 60 years. You will get the remaining amount as pension paid on a regular basis from an insurance firm registered under PFRDA. Moreover, the withdrawn amount is tax-exempted. It is always advisable to stay invested in the NPS until you retire, allowing your money to grow into significant wealth. But NPS allows you to withdraw up to 25 of the fund for emergency purposes after staying invested for at least three years. The reasons for withdrawal can be medical treatment for yourself or your family, buying or building a house, higher education or wedding of children, and other purposes. You can withdraw the money three times during the investment tenure with a minimum gap of five years between each withdrawal. Equity allocation flexibility The Scheme E of NPS lets you invest up to 50 of the money in equity-based options. You may decide between active and auto choices for equity investments. If you select the former, you will have the freedom to decide how much to invest in equities within the set limit. The latter decides the equity contributions as per your age. The older you get, the lower will be the equity allocation, thereby reducing risk. The formula for calculating the NPS amount NPS offers compound interest like any other high-return investment product. You can use an NPS calculator to determine how much return you can expect from your investment within seconds. But, if you want to understand how the calculation works, it is important to learn the NPS formula, which uses multiple components A  Maturity amount P  Principal amount invested r  Annual interest rate n  Number of times the interest is compounded t  Tenure of investment Based on the above components, the formula is A  P x 1  rn n. t Let us understand the formula with the help of an example. Suppose you are presently 34 years old and decide to start contributing 3,000 a month to the NPS account. If you get an interest rate of 10 during the investment tenure of 26 years, the maturity amount will be 44. 35 lakhs for a total contribution of 9. Using an NPS return calculator, you can determine the expected profit based on your age and monthly investment. How to use the NPS calculator The NPS calculator is quick and easy to use with the following five steps. Mention the amount you wish to contribute under the How much do you want to invest per month? section. Adjust the slider under Your Current Age to input your age. Adjust the slider under What Is Your Expected Rate of Return? to input the interest rate of NPS. Adjust the slider under What Percent Do You Wish to Invest in Annuity? to mention the percentage of the total contribution you want to be invested in annuity. Adjust the slider under How Many Years Do You Wish to Invest? to provide the investment tenure. After you provide the details based on your requirements, the NPS pension calculator will show your total investment, lump-sum value, annuity value, and total maturity amount. Where to invest NPS vs. PPF Public Provident Fund PPF and NPS both are popular investment options in India, especially among people who want to build a substantial retirement fund. The choice depends on your investment goals and risk appetite. Both PPF and NPS offer a variety of benefits but also have fundamental differences. Below table shows a comparative analysis of both the options to help you make an informed decision. Criteria NPS PPF Rate of return Historically provided 8 to 10 interest. The current interest rate offered is 7. The government decides it quarterly. Lock-in period Until retirement 15 years Risk associated Minimum risk as the scheme controls it systematically. But NPS is linked to the market. So, it is not completely risk-free. No risk as the investment is not linked to the market. Tax benefits Section 80C of the Income Tax Act, 1961 offers a tax deduction of up to  1. 5 lakhs on your contribution. Another  50,000 of tax deduction is available under Section 80CCD1B. You can get a tax deduction of up to  1. 5 lakhs on your investment under Section 80C of the Income Tax Act, 1961. As you can see from the above information, NPS has the potential to offer higher maturity benefits. So, if you are willing to take a little risk, NPS will help you build a more sizable retirement fund than PPF. How does the NPS work? NPS has two stages accumulation and retirement. Accumulation  During this stage, NPS uses your contribution to accumulate funds by reinvesting the money in different options like debt instruments, equities, treasury bills, and government bonds. The growth continues until your retirement. Retirement  After retirement, you can withdraw up to 60 of the NPS fund. The remaining amount is used to invest in annuity plans that pay regular returns. FAQs related to the NPS calculator 1. Who can use the NPS calculator? Anyone eligible to invest in NPS can use the calculator. Presently, Indians between the age of 18 and 60 years can contribute to the scheme. If you belong to the group, the calculator will help you instantly get an idea about the potential returns. What does the calculator show? Once you input the investment amount, age, expected rate of return, and other required information, the calculator will reflect the following four things. Total investment Lump-sum value Annuity value Total maturity amount There are eight fund managers currently offering NPS in India. Before investing, you may check the net promoter score calculation to determine which service providers are more reliable and offer good returns while lowering the risks. In this article Calculators Similar articles that might interest you!",
    "length": 12441
  },
  {
    "url": "https://jupiter.money/calculators/employee-provident-fund-calculator/",
    "title": "PF Calculator - Free Online EPF Calculator with Formula, Calculations, and Example",
    "content": "Back to calculators Back Employee Provident Fund EPF  PF Calculator IN THIS ARTICLE More EMI Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator Other Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator What Is EPF? The Employee Provident Fund EPF, also known as Provident Fund PF , is a retirement benefit scheme that private sector companies offer to their employees. This scheme comes under the Employees Provident Fund and Miscellaneous Provisions Act, 1952, to ensure the financial security of private-sector employees. The Employees Provident Fund Organisation EPFO regulates the scheme. Under this structure, both employers and employees contribute an equal amount to the fund. Simply put, you invest a portion of your monthly salary in the PF, and your employer adds the same value to the fund. You receive the income generated from the PF after retirement. Thus, EPF assists in providing financial security even after retirement or loss of employment. Read on to learn how to calculate the proceedings from your PF account using our PF Calculator. What Is PF Calculator? Our calculator will help you determine the amount of money generated by your EPF and how much you can expect to get at retirement. Our online EPF calculator  Eliminates the need for calculating the PF amount manually every month. Eliminates the need of tracking changes in the PF interest rate as our calculator uses the current rate automatically. Informs you about any recent changes, contributions, or transactions after every use. Our notifications help you stay up-to-date with the PF account and any regulation introduced by the EPFO. It comes with the assurance that the information regarding your EPF remains accurate every time. How to Calculate EPF? Before understanding the formula used for our EPF calculator, you need to have an idea about a few details, such as the basic monthly salary and Dearness Allowance DA , your EPF contribution percentage, the employers contribution, and the interest rate. To explain the PF calculation formula, let us assume that your basic monthly salary with Dearness Allowance DA is 15,000, your contribution to EPF is 12 of the amount, and the employers contribution towards EPF is 3. The employers invest the remaining 8. 33 in the Employee Pension Scheme. As per the above illustration Your contribution to the EPF will be 12 of 15,000  1,800 Your employers investment in EPS will be 8. 33 of  15,000  1,250 Your employers contribution towards EPF will be your contribution minus the employers contribution towards the EPS  1,800 - 1,250  550 Hence, the total monthly contribution to the PF account will be 1,800  550  2,350 With the current yearly interest rate of 8. 5, you will get a monthly interest rate of 8. The value of the PF fund on your joining month will be 2,350, as the employers do not pay any interest for the first month. The following month, the total contribution will become 2,350  2,350  4,700. You will also receive an interest of 4,700 x 0. The PF calculation uses the same formula for the subsequent months. Benefits of EPF Scheme Some of the essential features and benefits of EPF include You can avail of its multiple tax exemptions. The interest earned, any withdrawal made after the first five years of employment, and maturity returns from the EPF offer tax benefits. Additionally, Section 80C of the Income Tax Act, 1961 makes your contribution to the PF tax-deductible. However, the interest earned from the EPF is tax-free only if your yearly contribution is under 2. If it is over this amount, you will have to pay a tax on the interest income. You can make withdrawals from the PF in case of any financial or medical emergency before the schemes maturity. You can add a family member as your nominee to the PF. If an unfortunate event leads to your absence, the nominees will receive the accumulated PF amount. You also get a life insurance cover under the EPF, ensuring the financial security of your nominees. Employees Deposit Linked Insurance Scheme EDLI1976 rules offer this benefit. You can withdraw the money from your PF after two months from the date of resignation if you decide to leave the job. You also have the option to use the Volunteer Provident Fund feature of PF, which allows you to contribute more than 12 if you so wish. Changes in PF interest rates over the years EPFOs Central Board of Trustees consults with the Ministry of Finance to determine the EPF interest rate every year. Here is a list of the interest rate over the last six financial years. FY Interest Rate 2016-17 8. 25 How to check your EPF account balance online Understanding how PF is calculated is necessary to determine your profits from the scheme. You can also find the balance online through multiple options, such as 1. Umang App by the Government of India Follow the below steps to check the EPF balance with the Umang App. Download the app on your smartphone Register on the app with your mobile number Check the EPF balance along with raising and tracking claims 2. SMS If your Universal Account Number UAN is registered with the EPFO, you can find the PF balance and your latest contribution by sending an SMS from your registered phone number. Type EPFOHO followed by the UAN and the first three letters of your chosen language, for example, ENG for English. Send it to 7738299899. Missed call Give a missed call to 011-22901406 from your registered mobile number to know the PF balance. This option only works if the UAN is linked with your PAN, Aadhar Number, and bank account. If the accounts are not already linked, you can request your employer to do it. E-Sewa Portal The EPFO E-Sewa Portal lets you check your EPF passbook online. Register your account with the portal and link your UAN first. Then, to see or download the passbook online Visit www. in and log in using your registered account. Find the Our Services section and click the For Employees option under it. Select the Member Passbook alternative under the Services section. Log in to the Passbook section using your ID and password to check your EPF balance. How to transfer money from an existing EPF account Even if you change your job, your UAN will remain the same. You can use it to transfer the money to your new employers EPF account. Here are the steps to complete the process successfully Log in to the EPF members portal. Enter the Online Transfer Claim Portal section and log in using the same ID and password that you used for the EPF portal. Click the Request for Transfer of Funds option and provide the required details about your previous employer. Get the information authenticated by either your new or previous employer. Save the PIN that you will get via SMS on your registered mobile number. Save the tracking ID that you will receive to use for checking the transfer applications status. FAQs Can I use the same calculator after changing my employer? Yes. Input the relevant information required and use our calculator seamlessly, even after you switch jobs. How many times can I use the calculator? You can use our EPF Pension calculator as many times as you want. Calculate the interest earned over the years and the total sum after retirement. Its totally free! In this article Calculators Similar articles that might interest you!",
    "length": 10425
  },
  {
    "url": "https://jupiter.money/calculators/public-provident-fund-calculator/",
    "title": "Public Provident Fund Calculator| Online PPF Calculator",
    "content": "Back to calculators Back Public Provident Fund Calculator IN THIS ARTICLE More EMI Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator Other Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator What Is PPF? Public Provident Fund PPF is one of the most popular investment options in India. It is a long-term investment product managed by the Central Government, making it a safe choice for everyone. It has a 15-year lock-in period that allows your money to grow into significant wealth over the long run. It is mainly popular due to risk-free returns and tax benefits. The invested amount and the maturity benefit of PPF both are tax-exempted, making it an attractive option. You can put a minimum of 500 and a maximum of 1. 5 lakhs in the PPF account during a financial year. Moreover, the current rate of interest offered on PPF is 7. However, before investing in this instrument, it is advisable to use a PPF calculator online and get a clear idea about the expected returns. This article covers everything you must know about the calculator. What Is PPF Calculator? To calculate the potential return from a PPF, you must consider various factors. Determine how frequently you want to invest, how much you can deposit in the account, and if you wish to stay invested after the lock-in period. All these aspects can make the calculation rather tricky and time-consuming. And this is when the PPF calculator comes to your rescue. The rate of interest on PPF is periodically determined by the Central Government. The calculator considers the rate of interest prevalent at the time of investment and provides you with the result accordingly. In simple words, it is a tool that will tell you how much profit you can generate by investing in PPF. How the PPF Calculator Can Help You? PPF can be confusing, especially for first-time investors. The calculator makes it easy for everyone to keep an eye on their account balance and growth. It can also help resolve your queries about the changing interest rates or how they affect your maturity value. The tool accurately calculates your potential profit and shows you the data within seconds. The best thing is that you only need to provide some basic information such as deposit amount, investment frequency, and tenure. Thereafter, you can automatically see the current PPF interest rate on the calculator. This makes the calculations quick and easy for you. Formula and procedure used for calculating the PPF interest PPF offers compound interest, which is calculated on the available balance annually. The formula has different components F Maturity benefit P Annual installments n Number of years i Interest rate100 The PPF formula F  P x 1i n  - 1i Let us understand this with an example. Suppose you invest 1 lakh to the account every year for 15 years, and the rate of interest is 7. Using the above formula, your estimated maturity amount is 1 lakh x 1i 15 -1i  31,17,276. How to use PPF Calculator? The latest PPF calculator 2020-21 is easy to use. Check out the below instructions to get the result quickly. Frequency of Investment This is generally the first step to follow. There are 4 options under this section Monthly, Quarterly, Half-Yearly, and Yearly. You may choose one based on how often you want to invest in the PPF account in a financial year. Deposit Amount Under this option, you must enter your preferred investment amount for the payment frequency you chose earlier. You may invest up to 1. Current PPF Balance This section is for those who already have an accumulated balance in the PPF account. If you are investing for the first time, leave it blank, it will show 0. Otherwise, mention the balance amount you have. Duration of Investment You will find a slider under this section that ranges from 15 years to 70 years. You can adjust it depending on your preferred investment term. After selecting the tenure, the calculator will automatically determine the estimated returns based on your inputs and the current rate of interest offered by the government. On the left side of the calculator, you will find the amounts for the total investment made, total interest earned, and the maturity value. How PPF is Calculated? The return on your account balance is calculated monthly based on the interest rate offered in that quarter. But the PPF credits the interest earned during a financial year only when the year ends. For the monthly calculation, the lowest amount recorded in your account from the 5th day of a month to the last day of that month is considered. Suppose your PPF balance on 1st April 2021 is 10,000, and you deposit another 30,000 on 3rd April 2021. In this scenario, the interest will be calculated on 40,000. But, if you deposit 30,000 on 6th April 2021, the interest will be calculated only on 10,000. Also, PPF offers compound interest on your balance. So, at the end of each year, the interest is calculated on your total balance principal amount and the interest already earned. Moreover, you may remain invested in the PPF after the lock-in period even without making additional deposits. You will still receive annually compounded returns on the balance amount. Advantages of PPF Calculator The calculator serves many purposes, making it a helpful tool for both new and experienced investors. Here are five ways the calculator can help you. Resolves queries If you are unsure of how PPF works, the calculator can help. When you input different figures on the tool, you can see how it works. If you have any queries about PPF, the results generated on the calculator will help resolve them. Helps make investment decisions PPF does not require a fixed investment amount. You may choose the sum and investment frequency depending on your comfort. When you provide the required information, it shows the return you can expect at the end of 15 years. You can make investment decisions based on that. Can be used multiple times There is no limit to how many times you can use the PPF account calculator. So, you can try out different investment amounts and frequencies multiple times. This way, you will be able to figure out how much to invest to get your desired return. Error-free results Manual calculations always leave room for human errors, especially if you have to do it frequently. The calculator is an automated tool that eliminates the possibility of errors and provides precise data every time. Helps with tax planning PPF is a tax-saving investment product. So, you may use the calculator when planning your taxes to determine how much you can save by putting your money in PPF. You can strategize your investments accordingly. Reflects wealth accumulation period PPF allows you to continue investing even after the lock-in period. So, if you are planning long-term investments for wealth creation, you can use the calculator to check potential growth beyond the initial 15 years. Recent PPF interest rates The PPF interest rates change every quarter. These are linked to the ten-year government bond yield. Check out the below table to see how the rate changed over the last two financial years. Period Interest rate April to June 2021 7. 1 January to March 2021 7. 1 October to December 2020 7. 1 July to September 2020 7. 1 April to June 2020 7. 1 January to March 2020 7. 9 FAQs related to PPF calculator 1. How does the PPF calculator help? The PPF interest calculator is an online tool that helps determine how much profit you can generate by investing in PPF. Once you enter the investment amount, frequency, and tenure on the calculator, it will show you the amount of interest and total returns you will earn at maturity. Is the PPF calculator free? Yes, the calculator is free of cost, and there is no limit to how many times you can use it. How accurate is the PPF calculator? The calculator is an automated tool that uses the data provided by you to determine the maturity amount with 100 accuracy. The possibility of error is nil as the process is computerized. Is it possible to use the PPF calculator for an investment tenure of more than 15 years? The calculator has the option to choose an investment tenure between 15 and 70 years. If you want to continue investing after the initial lock-in period of 15 years, select the tenure accordingly. The calculator will display the estimated maturity amount based on the information provided by you. Why is there no option to provide the interest rate on the PPF calculator? PPF interest rates are determined by the Central Government at the beginning of every quarter. These are based on the average government bond yield in the last three months. The calculator automatically uses the latest rate of interest to provide the most up-to-date result. The current PPF interest rate for the April to June 2021 period is 7. In this article Calculators Similar articles that might interest you!",
    "length": 11995
  },
  {
    "url": "https://jupiter.money/calculators/salary-calculator/",
    "title": "In Hand Salary Calculator - Calculate Take Home Salary",
    "content": "Back to calculators Back In Hand Salary Calculator IN THIS ARTICLE More EMI Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator Other Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator What Is Salary Calculator? A take home salary in-hand calculator is an automated tool that helps you figure out your net salary after taxation. It also considers all the bonuses and deductions applicable. You must provide the gross salary and total bonus. The calculator will then determine the CTC and show you the amounts of basic salary, HRA, other allowances, deductions for provident fund and professional tax, total deduction, net salary, income tax, and net salary after income tax deduction. How to use a Salary Calculator? The process to use the salary calculator is quick and simple. Follow the three steps given below Step 1 Choose if you want to calculate monthly or yearly salary. Step 2 Enter the gross salary and total bonus amount to determine Cost to Company CTC. Step 3 Input the basic salary percentage of the CTC. The calculator may consider the basic salary as 50 of the CTC by default. You may change it as per your need. Once you enter the required details, the calculator will instantly provide the following information. Basic Salary HRA Other Allowances Provident Fund Professional Tax Total Deductions Net Salary Income Tax Net Salary Post Tax Jupiters Salary Calculator tool can also help you calculate salary per month. Just toggle the YearlyMonthly option to Monthly. Components of Your Salary Slip In every professional field, employees get paid at the end of the month by their employers. This payment is called the salary. The amount they receive is usually mentioned in their contract as well as the pay slip. The salary has many components that may vary among different employers. Below is a list of the most common breakdown of the salary structure. Basic salary It is a part of the Cost to Company CTC that the employers pay to the employees for their services. The basic salary is generally around 40 to 50 of your total salary. There is no formula to calculate this amount. It depends on factors like the industry, employee designation, and much more. House Rent Allowance HRA Companies pay the HRA to employees who stay in a rented property. The HRA amount equals 50 of the basic salary if you live in metro cities. For the non-metro cities, the amount is 40 of your basic salary. Section 10 13A of the Income Tax Act, 1961 makes the HRA partially or fully tax exemptible. But, if you do not stay in a rented property, the entire component is taxable. Leave Travel Allowance LTA Employers pay this benefit for you and your familys domestic travel expenses during a holiday. The allowance only covers railway ticket prices and airfares. Section 105 of the Income Tax Act, 1961 offers tax exemption on the LTA amount for up to two holidays in a four-calendar-year block. You need to submit proof of travel to receive the tax benefit. Special Allowance This is a fixed amount your employer may pay above your basic salary. The Special Allowance varies among companies as it depends on multiple factors. Moreover, it is fully taxable. Bonus Bonus is a component of the gross salary that the employers may pay as a performance encouragement. The entire bonus amount is fully taxable. Employee Provident Fund EPF It is generally a mandatory savings scheme. You need to pay 12 of your basic salary as an EPF contribution. Moreover, your employer matches your contribution and invests the same amount in your EPF account. Your contribution is tax-deductible up to 1. 5 lakhs under Section 80C of the Income Tax Act , 1961. The employers contribution to EPF is a part of the CTC, and it does not appear on the salary slip. Calculate EPF Salary Calculation Formula As the salary calculations involve various components, you need to use different formulas to calculate each aspect. Only then you can estimate your take-home salary. Here are some important salary calculation formulas that you must know. Take-Home Salary  Gross Salary  Income Tax  Employee Provident Fund EPF  Professional Tax if applicable Gross Salary  Basic Salary  Allowances  Bonuses  Overtime Pay if applicable Gratuity  Basic Salary  Dearness Allowance  15  Years of Service  26 Taxable Income  Gross Salary - EPFPPF Contribution - Tax-Free Allowances - HRA - LTA - Health Insurance Premiums - Tax-Saving Investments e. , 80C, 80D - Other Deductions e. , Standard Deduction, Home Loan Interest How to Calculate Monthly Take-Home Salary? Your monthly take-home salary is the amount that remains after subtracting the total deductions from gross pay. Let us understand the calculations using examples. Gross Salary 1,000,000 2. Deductions Basic Salary 50 of Gross Salary 1,000,000  50  500,000 Employee Provident Fund EPF Contribution  12 of Basic Salary 500,000  12  60,000 Professional Tax average 2,500 varies by state 3. Income Tax Calculation - Indias 2024-25 AY 2025-26 As announced in the Union Budget 2024, the income tax slabs under the new tax regime have been revised. These updated rates will take effect from 1st April 2025, and will be applicable for the Assessment Year 2025-26. The revised income tax slabs for salaried individuals are as follows New Regime FY 2024-25 Range of Income Rs. Tax Rate Up to 3,00,000 NIL 3,00,000-7,00,000 5 7,00,000-10,00,000 10 10,00,000-12,00,000 15 12,00,000-15,00,000 20 Above 15,00,000 30 Heres the simple income tax calculation for a salary of 10,00,000 under the New Tax Regime for FY 202425 AY 202526 First 3,00,000 No tax 0 Next 4,00,000 3,00,001  7,00,000 4,00,000  5  20,000 Next 3,00,000 7,00,001  10,00,000 3,00,000  10  30,000 Total Tax 0 for first 3,00,000  20,000 for next 4,00,000  30,000 for the last 3,00,000  50,000 4. Total Deductions Income Tax 50,000 EPF 60,000 Professional Tax 2,500 Total Deductions 50,000  60,000  2,500  1,12,500 5. Take-Home Salary Gross Salary - Total Deductions  1,000,000 - 1,12,500  8,87,500 Final Take-Home Salary 8,87,500 How to Calculate Take Home Salary After Taxes? Everyone is curious what their take home pay will be once an organization decides the appraisal for the employee or share the new offer letter to a candidate. Lets breakdown how to calculate take home pay after the taxation. Firstly you have to find out your taxable income. All the variables are explained above as well. Assumptions Gross Salary 1,000,000 EPF Contribution 12 of basic salary assuming basic salary is 50 of gross salary HRA Exemption Well assume 40 of basic salary as HRA and 50 of that as exempt. LTA Exemption 20,000 assumed Health Insurance Premium 15,000 assumed under Section 80D Tax-Saving Investments e. , under 80C 150,000 maximum allowed Standard Deduction 50,000 as per 2023-24 rules Now, lets calculate each component. For a gross salary of 1,000,000, the taxable income is calculated as 605,000, after accounting for EPF, HRA exemption, LTA, health insurance premiums, tax-saving investments, and the standard deduction. Breakdown of Deductions EPF Contribution 12 of basic salary 60,000 HRA Exemption 50 of HRA 100,000 LTA Exemption 20,000 Health Insurance Premium 15,000 Tax-Saving Investments 80C 150,000 Standard Deduction 50,000 Total deductions 60,000  100000  20000  15000  150000  50000  395000 Net Taxable Income after Taxes 10,00,000 - 3,95,000  6,05,000 Total deductions reduce the gross salary to arrive at the taxable income of 605,000. How to Calculate Gratuity? Gratuity  Basic Salary  Dearness Allowance  15  Years of Service  26 Gross Salary  1,000,000 Basic Salary  50 of Gross Salary  500,000 Dearness Allowance DA  0 Assumed Years of Service  20 years Calculation Basic Salary  500,000 50 of 1,000,000 Dearness Allowance DA  0 Assumed DA is not applicable Total of Basic Salary  DA  500,000  0  500,000 Gratuity Calculation formula Gratuity  500,000  15  20 26   500,000  300  26  150,000,0000 26  5,769,231 Gratuity Amount - 5,769,231 Benefits of Salary Calculator in India Quick Results Jupiters salary calculator shows take-home pay within seconds. Tracks Changes It helps you understand changes in your salary when you receive bonuses or deductions. Clear Breakdown The calculator gives a clear view of each part of your salary, including all amounts and deductions. Budgeting Help By estimating your take-home pay after taxes, the calculator is useful for planning monthly expenses and savings. Supports Decisions When considering a job offer or a raise, the calculator adjusts to show your new salary structure, helping you make informed choices about income, cost of living, and taxes. Negotiation Tool With a breakdown of gross and net pay, the calculator is helpful during salary discussions to make sure offers match your needs. Detailed Deductions Jupiters CTC calculator also provides details on monthly and yearly deductions, plus contributions toward EPF from both you and your employer. Some commonly searched salaries Please note that this is just for informational purposes only. Annual Salary LPA - lakh per annum Monthly Salary Range Yearly Salary Range 1 LPA in hand salary 7,600 to 8,300 91,600 to 1,00,000 1. 5 LPA in hand salary 11,500 to 12,500 1,38,600 to 1,50,000 2 LPA in hand salary 15,500 to 16,600 1,85,600 to 1,97,600 2. 3 LPA in hand salary 17,817 to 19,100 2,13,000 to 2,27,600 3 LPA in hand salary 23,300 to 25,000 2,79,600 to 2,97,600 3. 8 LPA in hand salary 29,500 to 31,400 3,54,800 to 3,77,600 3. 9 LPA in hand salary 30,350 to 32,300 3,64,200 to 3,87,600 4 LPA in hand salary 31,100 to 33,133 3,73,600 to 3,97,600 5 LPA in hand salary 38,900 to 41,400 4,67,600 to 4,97,600 5. 5 LPA in hand salary 42,800 to 45,600 5,14,600 to 5,47,600 6 LPA in hand salary 45,500 to 49,800 5,61,600 to 5,97,600 7 LPA in hand salary 51,000 to 54,600 6,12,000 to 6,55,200 8 LPA in hand salary 57,200 to 62,400 6,87,400 to 7,49,600 8. 5 LPA in hand salary 60,400 to 66,384 7,24,800 to 7,96,600 9 LPA in hand salary 63,600 to 70,300 7,63,200 to 8,43,600 9. 2 LPA in hand salary 64,900 to 71,800 7,74,800 to 8,62,400 9. 5 LPA in hand salary 66,800 to 73,700 8,00,000 to 8,84,900 9. 6 LPA in hand salary 67,400 to 74,400 8,08,000 to 8,93,000 9. 8 LPA in hand salary 68,700 to 75,700 8,24,400 to 9,09,000 10 LPA in hand salary 70,000 to 77,000 8,40,000 to 9,25,000 11 LPA in hand salary 76,300 to 76,300 9,15,600 to 10,05,000 11. 5 LPA in hand salary 79,300 to 87,100 9,51,600 to 10,45,300 12 LPA in hand salary 82,000 to 90,400 9,84,000 to 10,85,400 13 LPA in hand salary 87,600 to 97,100 10,51,200 to 11,65,800 13. 5 LPA in hand salary 90,300 to 1,00,400 10,83,600 to 12,05,700 14 LPA in hand salary 93,100 to 1,03,800 11,17,200 to 12,45,800 15 LPA in hand salary 98,600 to 1,10,500 11,83,200 to 13,26,000 16 LPA in hand salary 1,04,100 to 1,17,100 12,49,200 to 14,06,200 16. 5 LPA in hand salary 1,06,900 to 1,20,500 12,82,800 to 14,46,800 17 LPA in hand salary 1,09,700 to 1,23,700 13,16,400 to 14,84,400 17. 5 LPA in hand salary 1,12,400 to 1,26,700 13,48,800 to 15,21,000 18 LPA in hand salary 1,15,200 to 1,29,800 13,82,400 to 15,57,700 19 LPA in hand salary 1,20,700 to 1,35,900 14,48,400 to 16,31,000 20 LPA in hand salary 1,26,200 to 1,42,000 15,14,400 to 17,04,300 21 LPA in hand salary 1,31,800 to 1,48,100 15,81,600 to 17,77,600 22 LPA in hand salary 1,37,300 to 1,54,200 16,47,600 to 18,50,900 22. 5 LPA in hand salary 1,40,100 to 1,57,200 16,81,200 to 18,87,500 24 LPA in hand salary 1,48,300 to 1,66,400 17,79,600 to 19,97,500 26 LPA in hand salary 1,59,400 to 1,78,600 19,12,800 to 21,44,100 28 LPA in hand salary 1,70,500 to 1,90,800 20,46,000 to 22,90,700 30 LPA in hand salary 1,81,500 to 2,03,100 21,78,000 to 24,37,300 34 LPA in hand salary 2,03,600 to 2,27,500 24,43,200 to 27,30,500 35 LPA in hand salary 2,09,100 to 2,33,600 25,09,200 to 28,03,800 36 LPA in hand salary 2,14,700 to 2,39,700 25,76,400 to 28,77,100 37 LPA in hand salary 2,20,200 to 2,45,800 26,42,400 to 29,50,420 40 LPA in hand salary 2,36,800 to 2,64,100 28,41,600 to 31,70,300 45 LPA in hand salary 2,64,400 to 2,94,735 31,72,800 to 35,36,800 85 LPA in hand salary 4,66,000 to 5,39,000 55,92,000 to 64,68,800 90 LPA in hand salary 4,92,500 to 5,69,600 59,10,000 to 68,35,300 1 crore per annum in hand salary 5,45,100 to 6,30,600 65,41,200 to 75,68,300 Assumptions for the above table - HRA is assumed to be at 50 of Basic Pay considering Metro cities like Mumbai, Delhi, Kolkata and Chennai 12 EPF of Basic Age is less than 60 yrs Old regime considered 1. 5 lakh 80C is completely utilised 50 of HRA is completely utilised LPA full form  LPA means Lakh Per Annum. It is one of the most commonly used term in Indian employment scenario to calculate the salary of an individual per annum. FAQs related to salary calculator 1. What do I need to know to use the salary calculator? You should only know your gross salary and total bonus. Once you provide the data, the calculator will show the other relevant salary components in no time. How does the calculator determine the basic pay? It calculates the basic salary as a percentage of the CTC. You may change the percentage based on your requirements. Can I find the TDS on the salary calculator? You cannot find the TDS on salary calculator separately. You can easily find the TDS amount on your salary slip. Does the salary calculator show the deductions? Yes, the calculator shows the professional tax and provident fund deductions. It also reflects the total deductions. The in-hand salary calculator is a free tool that you can use anytime. Its powerful mechanism offers you the required data in a jiffy and without any errors. When using the calculator, be careful about providing the correct amounts required to get accurate results. How much gratuity amount is deducted from salary? Most companies deduct around 4. 81 of your salary This includes your Basic salary  Dearness Allowance  6. What are the main components of salary structure? The main components of a salary structure include basic salary, HRA, DA, conveyance, medical allowance, special allowance, provident fund, professional tax, and bonuses. Does CTC include PF? Yes, CTC Cost to Company typically includes PF Provident Fund as part of the total compensation package, along with other benefits like bonuses and allowances. How do I know the break-up of my salary? You can find the breakdown of your salary on your salary slip or pay statement, which typically lists components like basic salary, allowances, deductions e. , PF and taxes, and bonuses. Your HR department can also provide detailed information. In this article Calculators Similar articles that might interest you!",
    "length": 17748
  },
  {
    "url": "https://jupiter.money/calculators/personal-loan-emi-calculator/",
    "title": "Personal Loan EMI Calculator: Calculate Your Monthly Payments Easily",
    "content": "Back to calculators Back Personal Loan EMI Calculator IN THIS ARTICLE More EMI Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator Other Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator Thinking about taking a personal loan but unsure about how much itll cost you each month? Youre not alone. One of the biggest hurdles when considering a personal loan is figuring out the monthly payments. Thats where a personal loan EMI calculator comes in handy. This simple tool can help you quickly estimate your monthly instalments, so you can make informed decisions about your finances. Lets see how it works. What is a Personal Loan EMI Calculator Personal Loan EMI Calculator is a handy online tool designed to assist you with your finances. It allows you to easily estimate your monthly payments based on the loan amount, interest rate, and repayment period. With just a few inputs, you can get a clear idea of your monthly financial obligation, helping you plan your budget better and decide if taking a personal loan is the right move for you. How to Use Our Personal Loan EMI Calculator To use our personal loan calculator, first scroll up the page. Once youre at the top, follow these steps to get started. Enter the Loan Amount Adjust the slider or type in the desired loan amount directly. Select the Interest Rate While the default rate is based on the current market trends, you can customise it to match your specific situation. Choose the Loan Tenure Slide the bar or input the desired loan duration in years. Calculate Your EMI Click the Calculate button to instantly see your estimated monthly payments. Review the Results The calculator will show you the following details EMI Your monthly instalments. Principal amount The total amount youre borrowing. Total interest The total interest youll pay over the loan tenure. Total amount paid The total amount youll pay, including the principal and interest. Compare Different Scenarios You can experiment with different loan amounts, interest rates, and tenures to see how they affect your EMIs and total cost. Apply for a Loan If youre satisfied with the results, you can click the Apply for Personal Loan button to proceed with the application process. EMI for common Loan amounts Note We have considered the interest rate at 11. 5 for the home loan EMI calculations. Use this for informational purposes only. To know how to save on interest amount, check the insights on the Personal Loan EMI calculator above. Amount Duration Years Duration Months EMI Equated Monthly Instalments Total Amount to be Paid Principal  Interest 1 lakh personal loan emi for 6 months 6 months 6 17,230 1,03,381 1 lakh personal loan emi for 1 year 1 12 8,862 1,06,338 1 lakh personal loan emi for 2 years 2 24 4,684 1,12,417 1 lakh personal loan emi for 3 years 3 36 3,298 1,18,714 2 lakh personal loan emi for 1 year 1 12 17,723 2,12,676 2 lakh personal loan emi for 2 years 2 24 9,368 2,24,834 2 lakh personal loan emi for 3 years 3 36 6,595 2,37,427 3 lakh personal loan emi for 1 year 1 12 26,585 3,19,014 3 lakh personal loan emi for 2 years 2 24 14,052 3,37,250 3 lakh personal loan emi for 3 years 3 36 9,893 3,56,141 4 lakh personal loan emi for 1 year 1 12 35,446 4,25,352 4 lakh personal loan emi for 2 years 2 24 18,736 4,49,667 4 lakh personal loan emi for 3 years 3 36 13,190 4,74,854 4 lakh personal loan emi for 5 years 5 60 8,797 5,27,823 5 lakh personal loan emi for 1 year 1 12 44,308 5,31,690 5 lakh personal loan emi for 2 years 2 24 23,420 5,62,084 5 lakh personal loan emi for 3 years 3 36 16,488 5,93,568 5 lakh personal loan emi for 5 years 5 60 10,996 6,59,778 5 lakh personal loan emi for 7 years 7 84 8,693 7,30,231 6 lakh personal loan emi for 2 years 2 24 28,104 6,74,501 6 lakh personal loan emi for 3 years 3 36 53,169 6,38,028 6 lakh personal loan emi for 5 years 5 60 13,196 7,91,734 6 lakh personal loan emi for 7 years 7 84 10,432 8,76,278 6 lakh personal loan emi for 10 years 10 120 8,436 10,12,287 7 lakh personal loan emi for 5 years 5 60 15,395 9,23,690 8 lakh personal loan emi for 5 years 5 60 17,594 10,55,645 8 lakh personal loan emi for 10 years 10 120 11,248 13,49,716 10 lakh personal loan emi for 5 years 5 60 21,993 13,19,556 10 lakh personal loan emi for 10 years 10 120 14,060 16,87,145 15 lakh personal loan emi for 10 years 10 120 21,089 25,30,718 How to Calculate Personal Loan EMI Document The EMI calculation is based on a standard mathematical formula EMI  P  r  1 r  n 1 r  n -1 Where PPP is the principal loan amount r is the monthly interest rate annual interest rate divided by 12 and then by 100 n is the loan tenure in months loan tenure in years multiplied by 12 Explanation with an Example Lets consider an example to illustrate the calculation Loan Amount P 1,00,000 Annual Interest Rate 16 Loan Tenure 3 years Step 1 Convert the annual interest rate to a monthly rate r  16 12  100  0. 01333 Step 2 Convert the loan tenure to months n  3  12  36 Step 3 Plug these values into the formula EMI  1,00,000  0. 01333  36 -1 Step 4 Calculate the EMI EMI  1,00,000  0. 6107 EMI  3,516 So, the monthly EMI for a 100,000 loan at 16 annual interest over 36 months would be approximately 3,516. Benefits of Personal Loan EMI Calculator 1. User-friendly These calculators are designed with simplicity in mind. With just a few clicks, you can input your loan amount, interest rate, and tenure to get an instant estimate of your monthly instalments. Time-saver Instead of spending hours calculating EMIs manually, a calculator can give you the exact figure in seconds. This saves you time and effort. Accurate Results You can trust the results provided by a personal loan EMI calculator. These tools are programmed to give you precise figures based on the input data. Aids in Better Planning Knowing your EMI beforehand can help you plan your finances better. You can adjust your loan amount or tenure to fit your budget and repayment capacity. How Can a Personal Loan Calculator Help You in Financial Planning A personal loan EMI calculator can be a real lifesaver when it comes to managing your repayments. Estimate Your Monthly Payments Figure out how much youll need to pay each month based on the loan amount, duration, and interest rate. Stick to Your Budget Play around with different numbers to see what payment fits your budget best. Compare Your Options See which loan is the best deal for you by comparing different amounts, interest rates, and terms. Plan Your Loan Term Decide how long you want to pay back the loan, considering both monthly payments and total interest. Evaluate Prepayment See how much you can save by paying extra on your loan or paying it off early. Make Smart Financial Choices Understand the long-term costs and benefits of taking out a loan. Factors Affecting Personal Loan EMI Calculation When figuring out your monthly payments EMIs for a personal loan, a few things matter. Understanding these can help you plan your finances better and choose a loan that fits your budget. Heres what affects your EMIs 1. Loan Amount  The total amount you borrow is a key factor in determining your EMI. Generally, a larger loan amount leads to higher EMIs. Interest Rate The interest rate charged on the loan plays a significant role in calculating EMIs. Higher interest rates result in higher EMIs, while lower rates reduce the monthly payment. Interest rates can be fixed or variable, which can affect how your EMIs change over time. Loan Tenure Longer loan terms mean lower monthly payments but higher overall interest costs. Shorter terms have higher monthly payments but lower overall interest costs. Fees Processing fees and other charges can add to the total cost of the loan and affect your monthly payments. Prepayment and Foreclosure If you plan to pay off your loan early , be aware of any penalties or charges that may apply. These can impact your monthly payments. Closing Thoughts A personal loan EMI calculator is a simple yet powerful tool that can take the guesswork out of your financial planning. By helping you understand your monthly obligations, it allows you to make better-informed decisions about taking on a loan. Give it a try to see how it can work for you. Frequently Asked Questions 1. How are Personal Loan EMIs paid? Personal Loan EMIs are typically paid through auto-debit from your linked bank account. How can I reduce my Personal Loan EMI? You can reduce your EMI by increasing the loan tenure or by making prepayments. Is collateral required for a Personal Loan? No, Personal Loans are generally unsecured loans, meaning they dont require collateral. Does the EMI amount remain fixed throughout the loan tenure? Yes, the EMI amount remains fixed throughout the loan tenure. How can I avail a Personal Loan with low interest rates on Jupiter? If you have a Salary Account on the Jupiter App, your eligibility for a Personal Loan with low interest rates will depend on factors like your credit score and account history. If you dont have a Salary Account, you can increase your chances by having two continuous salary credits. What is the eligibility for a Personal Loan on Jupiter? Eligibility for a Personal Loan on Jupiter depends on factors like your credit score, income, and account history. Please refer to our main eligibility page for more details. What is the Personal Loan interest rate on Jupiter? The Personal Loan interest rate on Jupiter ranges from 16 to 28 Annual Percentage Rate. The actual rate varies based on multiple factors. Please reach out to the Jupiter team for more information. Processing fees are up to 3  GST. In this article Calculators Similar articles that might interest you!",
    "length": 12796
  },
  {
    "url": "https://jupiter.money/calculators/credit-card-emi-calculator/",
    "title": "Credit Card EMI Calculator with GST",
    "content": "Back to calculators Back Credit Card EMI Calculator IN THIS ARTICLE More EMI Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator Other Calculators Home Loan EMI Calculator AU Bank Home Loan Calculator Bandhan Bank Home Loan Calculator Central Bank Home Loan Calculator Citibank Home Loan Calculator DCB Bank Home Loan Calculator IIFL Home Loan Calculator IndusInd Bank Home Loan Calculator IOB Home Loan EMI Calculator Karnataka Bank Home Loan EMI Calculator KVB Home Loan Calculator Piramal Home Loan Calculator Saraswat Bank Home Loan Calculator Yes Bank Home Loan Calculator LIC Home Loan EMI Calculator HSBC Bank Home Loan EMI Calculator RBL Bank Home Loan Calculator Tata Capital Home Loan Calculator Credit Card EMI Calculator Personal Loan EMI Calculator EMI Calculator -     Federal Bank Home Loan EMI Calculator UCO Bank Home Loan EMI Calculator Bank of Maharashtra Home Loan EMI Calculator Union Bank Home Loan EMI Calculator Kotak Home Loan EMI Calculator IDBI Home Loan Calculator ICICI Bank Home Loan EMI Calculator HDFC Home Loan Calculator State Bank of India Home Loan EMI Calculator PNB Home Loan Calculator Axis Bank Home Loan Calculator Bank of Baroda Home Loan Calculator Canara Bank Home Loan Calculator Indian Bank Home Loan EMI Calculator BOI Home Loan Calculator IDFC Home Loan Calculator Employee Provident Fund EPF  PF Calculator HRA Calculator - House Rent Allowance Tax Calculation Simple Interest and Compound Interest Calculator Interest Rate Calculator Online Chai Sutta calculator Retirement Planning Calculator Fuel Cost Calculator Calculate Petrol Cost Per Km In Hand Salary Calculator Gratuity Calculator National Pension Scheme Calculator Return on Investment Calculator Public Provident Fund Calculator What is Credit Card EMI? A Credit Card EMI allows users to convert a large purchase made with a credit card into smaller, more manageable monthly installments. Instead of paying the full amount at once, you can chose to repay the amount in parts. Your bank will provide the feature to pay the amount back over a predefined tenure with applicable interest rate. What is a Credit Card EMI Calculator? A Credit Card EMI Calculator is a tool that helps you figure out how much you will pay each month if you convert a large purchase on your credit card into EMIs Equated Monthly Installments. How it works When you buy a product like a laptop, phone or an appliance you dont always have to pay the full amount upfront. Some banks offer EMI option on your Credit Card payment. With EMI, you can break the total cost into smaller monthly payments over a set period. However, the bank charges interest on this amount, which increases the total amount youll pay, but helps you pay the smaller amount at the time of purchase. Here are some of the terms that you will come across Principal Amount P  The total purchase amount converted to EMI. Interest Rate r  Annual or monthly interest rate charged on the EMI. Tenure n  The duration in months over which the EMI is paid. EMI  The fixed monthly payment made by the user. Document The EMI calculation is based on a standard mathematical formula EMI  P  r  1 r  n 1 r  n -1 Where PPP is the principal loan amount r is the monthly interest rate annual interest rate divided by 12 and then by 100 n is the loan tenure in months loan tenure in years multiplied by 12 Lets consider an example to understand the calculation Loan Amount P 55,000 Annual Interest Rate 16 Loan Tenure 1 year Step 1 Convert the annual interest rate to a monthly rate r  16 12  100  0. 01333 Step 2 Convert the loan tenure to months n  1  12  12 Step 3 Plug these values into the formula EMI  55,000  0. 01333  12 -1 Step 4 Calculate the EMI EMI  1,00,000  0. 1718 EMI  4,990 In this article Calculators Similar articles that might interest you!",
    "length": 5381
  }
]